{
  "placeType": null,
  "references": [
    {
      "text": "A strange appearance, known as the \"Scanlan Lights,\" is connected with the family of Scanlan of Ballyknockane, Co. Limerick, and is seen frequently at the death of a member. The traditional origin of the lights is connected with a well-known Irish legend, which we give here briefly. Scanlan Mor (died A.D. 640), King of Ossory, from whom the family claim descent, was suspected of disaffection by Aedh mac Ainmire, Ard-Righ of Ireland, who cast him into prison, and loaded him with fetters. When St. Columcille attended the Synod of Drom Ceat, he besought Aedh to free his captive, but the Ard-Righ churlishly refused; whereupon Columcille declared that he should be freed, and that that very night he should unloose his (the Saint's) brogues. Columcille went away, and that night a bright pillar of fire appeared in the air, and hung over the house where Scanlan was imprisoned. A beam of light darted into the room where he lay, and a voice called to him, bidding him rise, and shake off his fetters. In amazement he did so, and was led out past his guards by an angel. He made his way to Columcille, with whom he was to continue that night, and as the Saint stooped down to unloose his brogues Scanlan anticipated him, as he had prophesied. [*1]\nSuch appears to be the traditional origin of the \"Scanlan lights.\" Our correspondent adds: \"These are always seen at the demise of a member of the family. We have ascertained that by the present head of the family (Scanlan of Ballyknockane) they were seen, first, as a pillar of fire with radiated crown at the top; and secondly, inside the house, by the room being lighted up brightly in the night. By other members of the family now living these lights have been seen in the shape of balls of fire of various sizes.\" The above was copied from a private manuscript written some few years ago. Our correspondent further states: \"I also have met with four persons in this county [Limerick] who have seen the lights on Knockfierna near Ballyknockane before the death of a Scanlan, one of the four being the late head of the family and owner, William Scanlan, J.P., who saw the flames on the hill-side on the day of his aunt's death some years ago. The last occasion was as late as 1913, on the eve of the death of a Scanlan related to the present owner of Ballyknockane.\""
    }
  ],
  "placename": "Ballyknockane House"
}