{
  "placeType": null,
  "references": [
    {
      "text": "The present Archdeacon of Limerick, Ven. J. A. Haydn, LL.D., sends the following experience: \"In the year 1870 I was rector of the little rural parish of Chapel Russell. One autumn day the rain fell with a quiet, steady, and hopeless persistence from morning to night. Wearied at length from the gloom, and tired of reading and writing, I determined to walk to the church about half a mile away, and pass a half-hour playing the harmonium, returning for the lamp-light and tea.\n\"I wrapped up, put the key of the church in my pocket, and started. Arriving at the church, I walked up the straight avenue, bordered with graves and tombs on either side, while the soft, steady rain quietly pattered on the trees. When I reached the church door, before putting the key in the lock, moved by some indefinable impulse, I stood on the doorstep, turned round, and looked back upon the path I had just trodden. My amazement may be imagined when I saw, seated on a low, tabular tombstone close to the avenue, a lady with her back towards me. She was wearing a black velvet jacket or short cape, with a narrow border of vivid white: her head, and luxuriant jet-black hair, were surmounted by a hat of the shape and make that I think used to be called at that time a \"turban\"; it was also of black velvet, with a snow-white wing or feather at the right-hand side of it. It may be seen how deliberately and minutely I observed the appearance, when I can thus recall it after more than forty years.\n\"Actuated by a desire to attract the attention of the lady, and induce her to look towards me, I noisily inserted the key in the door, and suddenly opened it with a rusty crack. Turning round to see the effect of my policy--the lady was gone!--vanished! Not yet daunted, I hurried to the place, which was not ten paces away, and closely searched the stone and the space all round it, but utterly in vain; there were absolutely no traces of the late presence of a human being! I may add that nothing particular or remarkable followed the singular apparition, and that I never heard anything calculated to throw any light on the mystery.\""
    }
  ],
  "placename": "Chapell Russell"
}