{
  "placeType": null,
  "references": [
    {
      "text": "Here is a curious tale from the city of Limerick of a lady's \"double\" being seen, with no consequent results. It is sent by Mr. Richard Hogan as the personal experience of his sister, Mrs. Mary Murnane. On Saturday, October 25, 1913, at half-past four o'clock in the afternoon, Mr. Hogan left the house in order to purchase some cigarettes. A quarter of an hour afterwards Mrs. Murnane went down the town to do some business. As she was walking down George Street she saw a group of four persons standing on the pavement engaged in conversation. They were: her brother, a Mr. O'S--, and two ladies, a Miss P. O'D--, and her sister, Miss M. O'D--. She recognised the latter, as her face was partly turned towards her, and noted that she was dressed in a knitted coat, and light blue hat, while in her left hand she held a bag or purse; the other lady's back was turned towards her. As Mrs. Murnane was in a hurry to get her business done she determined to pass them by without being noticed, but a number of people coming in the opposite direction blocked the way, and compelled her to walk quite close to the group of four; but they were so intent on listening to what one lady was saying that they took no notice of her. The speaker appeared to be Miss M. O'D--, and, though Mrs. Murnane did not actually hear her speak as she passed her, yet from their attitudes the other three seemed to be listening to what she was saying, and she heard her laugh when right behind her--not the laugh of her sister P.--and the laugh was repeated after she had left the group a little behind.\nSo far there is nothing out of the common. When Mrs. Murnane returned to her house about an hour later she found her brother Richard there before her. She casually mentioned to him how she had passed him and his three companions on the pavement. To which he replied that she was quite correct except in one point, namely that there were only three in the group, as M. O'D-- was not present, as she had not come to Limerick at all that day. She then described to him the exact position each one of the four occupied, and the clothes worn by them; to all of which facts he assented, except as to the presence of Miss M. O'D--. Mrs. Murnane adds, \"That is all I can say in the matter, but most certainly the fourth person was in the group, as I both saw and heard her. She wore the same clothes I had seen on her previously, with the exception of the hat; but the following Saturday she had on the same coloured hat I had seen on her the previous Saturday. When I told her about it she was as much mystified as I was and am. My brother stated that there was no laugh from any of the three present.\""
    },
    {
      "text": "A story of a phantom rat, which comes from Limerick, is only one of many which show the popular Irish belief in hauntings by various animals. Many years ago, the legend runs, a young man was making frantic and unacceptable love to a girl. At last, one day when he was following her in the street, she turned on him and, pointing to a rat which some boys had just killed, said, \"I'd as soon marry that rat as you.\" He took her cruel words so much to heart that he pined away and died. After his death the girl was haunted at night by a rat, and in spite of the constant watch of her mother and sisters she was more than once bitten. The priest was called in and could do nothing, so she determined to emigrate. A coasting vessel was about to start for Queenstown, and her friends, collecting what money they could, managed to get her on board. The ship had just cast off from the quay, when shouts and screams were heard up the street. The crowd scattered, and a huge rat with fiery eyes galloped down to the quay. It sat upon the edge screaming hate, sprang off, and did not reappear. After that, we are told, the girl was never again haunted."
    }
  ],
  "placename": "City of Limerick"
}