{"placeType":null,"references":[{"text":"has been lost by a man telling his experiences of a ghost he happens to have met along some country lane; and the fact that there are cases where an imaginative and nervous person has mistaken for a ghost a white goat or a sheet hanging on a bush only strengthens the sceptic's disbelief and makes him blind to the very large weight of evidence that can be arrayed against him. Some day, no doubt, psychologists and scientists will be able to give us a complete and satisfactory explanation of these abnormal apparitions, but at present we are very much in the dark, and any explanation that may be put forward is necessarily of a tentative nature.The following story is sent us by Mr. J. J. Crowley, of the Munster and Leinster Bank, who writes as follows: \"The scene is outside Clonmel, on the main road leading up to a nice old residence on the side of the mountains called -- Lodge. I happened to be visiting my friends, two other bank men. It was night, about eight o'clock, moonless, and tolerably dark, and when within a quarter of a mile or perhaps less of a bridge over a small stream near the house[p. 123][paragraph continues] I saw a girl, dressed in white, wearing a black sash and long flowing hair, walk in the direction from me up the culvert of the bridge and disappear down the other side. At the time I saw it I thought it most peculiar that I could distinguish a figure so far away, and thought a light of some sort must be falling on the girl, or that there were some people about and that some of them had struck a match. When I got to the place I looked about, but could find no person there.\"I related this story to my friends some time after arriving, and was then told that one of them had wakened up in his sleep a few nights previously, and had seen an identical figure standing at the foot of his bed, and rushed in fright from his room, taking refuge for the night with the other lodger. They told the story to their landlady, and learned from her that this apparition had frequently been seen about the place, and was the spirit of one of her daughters who had died years previously rather young, and who, previous to her death, had gone about just as we described the figure we had seen. I had heard nothing of this story until after I[p. 124]"}],"placename":"Clonmel"}{
  "placeType": null,
  "references": [
    {
      "text": "A clergyman in the diocese of Clogher gave a personal experience of table-turning to the present Dean of St. Patrick's, who kindly sent the same to the writer. He said: \"When I was a young man, I met some friends one evening, and we decided to amuse ourselves with table-turning. The local dispensary was vacant at the time, so we said that if the table would work we should ask who would be appointed as medical officer. As we sat round it touching it with our hands it began to knock. We said:\n\"'Who are you?'\n\"The table spelt out the name of a Bishop of the Church of Ireland. We asked, thinking that the answer was absurd, as we knew him to be alive and well:\n\"'Are you dead?'\n\"The table answered 'Yes.'\n\"We laughed at this and asked:\n\"'Who will be appointed to the dispensary?'\n\"The table spelt out the name of a stranger, who was not one of the candidates, whereupon we left off, thinking that the whole thing was nonsense.\n\"The next morning I saw in the papers that the Bishop in question had died that afternoon about two hours before our meeting, and a few days afterwards I saw the name of the stranger as the new dispensary doctor. I got such a shock that I determined never to have anything to do with table-turning again.\""
    }
  ],
  "placename": "Clougher"
}