{
  "placeType": null,
  "references": [
    {
      "text": "A lady, formerly resident in Queen's Co. [now County Laois], but who now lives near Dublin, sends the following clear and concise account of her own personal experiences in a haunted house: \"Some years ago, my father, mother, sister, and myself went to live in a nice but rather small house close to the town of -- in Queen's Co. [now County Laois] We liked the house, as it was conveniently and pleasantly situated, and we certainly never had a thought of ghosts or haunted houses, nor would my father allow any talk about such things in his presence. But we were not long settled there when we were disturbed by the opening of the parlour door every night regularly at the hour of eleven o'clock. My father and mother used to retire to their room about ten o'clock, while my sister and I used to sit up reading. We always declared that we would retire before the door opened, but we generally got so interested in our books that we would forget until we would hear the handle of the door turn, and see the door flung open. We tried in every way to account for this, but we could find no explanation, and there was no possibility of any human agent being at work.\n\"Some time after, light was thrown on the subject. We had visitors staying with us, and in order to make room for them, my sister was asked to sleep in the parlour. She consented without a thought of ghosts, and went to sleep quite happily; but during the night she was awakened by some one opening the door, walking across the room, and disturbing the fireirons. She, supposing it to be the servant, called her by name, but got no answer: then the person seemed to come away from the fireplace, and walk out of the room. There was a fire in the grate, but though she heard the footsteps, she could see no one.\n\"The next thing was, that I was coming downstairs, and as I glanced towards the hall door I saw standing by it a man in a grey suit. I went to my father and told him. He asked in surprise who let him in, as the servant was out, and he himself had already locked, bolted, and chained the door an hour previously. None of us had let him in, and when my father went out to the hall the man had disappeared, and the door was as he had left it.\n\n\"Some little time after, I had a visit from a lady who knew the place well, and in the course of conversation she said:\n\n\"'This is the house poor Mr. -- used to live in.'\n\n\"'Who is Mr. --?' I asked.\n\n\"'Did you never hear of him?' she replied. 'He was a minister who used to live in this house quite alone, and was murdered in this very parlour. His landlord used to visit him sometimes, and one night he was seen coming in about eleven o'clock, and was seen again leaving about five o'clock in the morning. When Mr. -- did not come out as usual, the door was forced open, and he was found lying dead in this room by the fender, with his head battered in with the poker.'\n\"We left the house soon after,\" adds our informant."
    }
  ],
  "placename": "County Laois"
}