{
  "placeType": null,
  "references": [
    {
      "text": "The second of these, which is decidedly more complex and mystifying, refers to a rectory in Co. Donegal. It is sent as the personal experience of one of the percipients, who does not wish to have his name disclosed. He says: \"My wife, children, and myself will have lived here four years next January (1914). From the first night that we came into the house most extraordinary noises have been heard. Sometimes they were inside the house, and seemed as if the furniture was being disturbed, and the fireirons knocked about, or at other times as if a dog was running up and down stairs. Sometimes they were external, and resembled tin buckets being dashed about the yard, or as if a herd of cattle was galloping up the drive before the windows. These things would go on for six months, and then everything would be quiet for three months or so, when the noises would commence again. My dogs--a fox-terrier, a boar-hound, and a spaniel--would make a terrible din, and would bark at something in the hall we could not see, backing away from it all the time.\n\"The only thing that was ever seen was as follows: One night my daughter went down to the kitchen about ten o'clock for some hot water. She saw a tall man, with one arm, carrying a lamp, who walked out of the pantry into the kitchen, and then through the kitchen wall. Another daughter saw the same man walk down one evening from the loft, and go into the harness-room. She told me, and I went out immediately, but could see nobody. Shortly after that my wife, who is very brave, heard a knock at the hall door in the dusk. Naturally thinking it was some friend, she opened the door, and there saw standing outside the self-same man. He simply looked at her, and walked through the wall into the house. She got such a shock that she could not speak for several hours, and was ill for some days. That is eighteen months ago, and he has not been seen since, and it is six months since we heard any noises.\" Our correspondent's letter was written on 25th November 1913. \"An old man nearly ninety died last year. He lived all his life within four hundred yards of this house, and used to tell me that seventy years ago the parsons came with bell, book, and candle to drive the ghosts out of the house.\" Evidently they were unsuccessful. In English ghost-stories it is the parson who performs the exorcism successfully, while in Ireland such work is generally performed by the priest. Indeed a tale was sent to us in which a ghost quite ignored the parson's efforts, but succumbed to the priest."
    }
  ],
  "placename": "County Donegal"
} 