{
  "placeType": null,
  "references": [
    {
      "text": "As we have already stated in Chapter VII, a distinction must be drawn between the so-called Headless Coach, which portends death, and the Phantom Coach, which appears to be a harmless sort of vehicle. With regard to the latter we give two tales below, the first of which was sent by a lady whose father was a clergyman, and a gold medallist of Trinity College, Dublin.\n\"Some years ago my family lived in Co. Down. Our house was some way out of a fair-sized manufacturing town, and had a short avenue which ended in a gravel sweep in front of the hall door. One winter's evening, when my father was returning from a sick call, a carriage going at a sharp pace passed him on the avenue. He hurried on, thinking it was some particular friends, but when he reached the door no carriage was to be seen, so he concluded it must have gone round to the stables. The servant who answered his ring said that no visitors had been there, and he, feeling certain that the girl had made some mistake, or that some one else had answered the door, came into the drawing-room to make further inquiries. No visitors had come, however, though those sitting in the drawing-room had also heard the carriage drive up.\n\"My father was most positive as to what he had seen, viz. a closed carriage with lamps lit; and let me say at once that he was a clergyman who was known throughout the whole of the north of Ireland as a most level-headed man, and yet to the day of his death he would insist that he met that carriage on our avenue.\n\"One day in July one of our servants was given leave to go home for the day, but was told she must return by a certain train. For some reason she did not come by it, but by a much later one, and rushed into the kitchen in a most penitent frame of mind. 'I am so sorry to be late,' she told the cook, 'especially as there were visitors. I suppose they stayed to supper, as they were so late going away, for I met the carriage on the avenue.' The cook thereupon told her that no one had been at the house, and hinted that she must have seen the ghost-carriage, a statement that alarmed her very much, as the story was well known in the town, and car-drivers used to whip up their horses as they passed our gate, while pedestrians refused to go at all except in numbers. We have often heard the carriage, but these are the only two occasions on which I can positively assert that it was seen.\""
    }
  ],
  "placename": "County Down"
}