{
  "placeType": null,
  "references": [
    {
      "text": "A correspondent from County Wexford, who desires to have his name suppressed, writes as follows: \"Less than ten miles from the town of ?, Co. Wexford, lives a small farmer named M--, who by dint of thrift and industry has reared a large family decently and comfortably.\n\"Some twenty years ago Mr. M--, through the death of a relative, fell in for a legacy of about a hundred pounds. As he was already in rather prosperous circumstances, and as his old thatched dwelling-house was not large enough to accommodate his increasing family, he resolved to spend the money in building a new one.\"\n\"Not long afterwards building operations commenced, and in about a year he had a fine slated cottage, or small farm-house, erected and ready for occupation: so far very well; but it is little our friend M-- anticipated the troubles which were still ahead of him. He purchased some new furniture at the nearest town, and on a certain day he removed all the furniture which the old house contained into the new one; and in the evening the family found themselves installed in the latter for good, as they thought. They all retired to rest at their usual hour; scarcely were they snugly settled in bed when they heard peculiar noises inside the house. As time passed the din became terrible--there was shuffling of feet, slamming of doors, pulling about of furniture, and so forth. The man of the house got up to explore, but could see nothing, neither was anything disturbed. The door was securely locked as he had left it. After a thorough investigation, in which his wife assisted, he had to own he could find no clue to the cause of the disturbance. The couple went to bed again, and almost immediately the racket recommenced, and continued more or less till dawn.\n\"The inmates were puzzled and frightened, but determined to try whether the noise would be repeated the next night before telling their neighbours what had happened. But the pandemonium experienced the first night of their occupation was as nothing compared with what they had to endure the second night and for several succeeding nights. Sleep was impossible, and finally Mr. M-- and family in terror abandoned their new home, and retook possession of their old one.\n\"That is the state of things to this day. The old house has been repaired and is tenanted. The new house, a few perches off, facing the public road, is used as a storehouse. The writer has seen it scores of times, and its story is well known all over the country-side. Mr. M-- is disinclined to discuss the matter or to answer questions; but it is said he made several subsequent attempts to occupy the house, but always failed to stand his ground when night came with its usual rowdy disturbances.\n\"It is said that when building operations were about to begin, a little man of bizarre appearance accosted Mr. M-- and exhorted him to build on a different site; otherwise the consequences would be unpleasant for him and his; while the local peasantry allege that the house was built across a fairy pathway between two raths, and that this was the cause of the trouble. It is quite true that there are two large raths in the vicinity, and the haunted house is directly in a bee-line between them. For myself I offer no explanation; but I guarantee the substantial accuracy of what I have stated above.\"\nProfessor Barrett, in the paper to which we have already referred, draws certain conclusions from his study of this subject; one of the chief of these is that \"the widespread belief in fairies, pixies, gnomes, brownies, &c., probably rests on the varied manifestations of poltergeists.\""
    },
    {
      "text": "A gentleman named Miller resided in Co. Wexford, while his friend and former schoolfellow lived in the North of Ireland. This long friendship led them to visit at each other's houses from time to time, but for Mr. Miller there was a deep shadow of sorrow over these otherwise happy moments, for, while he enjoyed the most enlightened religious opinions, his friend was an unbeliever. The last time they were together Mr. Scott said, \"My dear friend, let us solemnly promise that whichever of us shall die first shall appear to the other after death, if it be possible.\" \"Let it be so, if God will,\" replied Mr. Miller. One morning some time after, about three o'clock, the latter was awakened by a brilliant light in his bedroom; he imagined that the house must be on fire, when he felt what seemed to be a hand laid on him, and heard his friend's voice say distinctly, \"There is a God, just but terrible in His judgments,\" and all again was dark. Mr. Miller at once wrote down this remarkable experience. Two days later he received a letter announcing Mr. Scott's death on the night, and at the hour, that he had seen the light in his room."
    }
  ],
  "placename": "County Wexford"
}