{
  "placeType": null,
  "references": [
    {
      "text": "Mr T. J. Westropp, to whom we are indebted for so much material, sends a tale which used to be related by a relative of his, the Rev. Thomas Westropp, concerning experiences in a house not very far from the city of Limerick. When the latter was appointed to a certain parish he had some difficulty in finding a suitable house, but finally fixed on one which had been untenanted for many years, but had nevertheless been kept aired and in good repair, as a caretaker who lived close by used to come and look after it every day. The first night that the family settled there, as the clergyman was going upstairs he heard a footstep and the rustle of a dress, and as he stood aside a lady passed him, entered a door facing the stairs, and closed it after her. It was only then he realised that her dress was very old-fashioned, and that he had not been able to enter that particular room. Next day he got assistance from a carpenter, who, with another man, forced open the door. A mat of cobwebs fell as they did so, and the floor and windows were thick with dust. The men went across the room, and as the clergyman followed them he saw a small white bird flying round the ceiling; at his exclamation the men looked back and also saw it. It swooped, flew out of the door, and they did not see it again. After that the family were alarmed by hearing noises under the floor of that room every night. At length the clergyman had the boards taken up, and the skeleton of a child was found underneath. So old did the remains appear that the coroner did not deem it necessary to hold an inquest on them, so the rector buried them in the churchyard. Strange noises continued, as if some one were trying to force up the boards from underneath. Also a heavy ball was heard rolling down the stairs and striking against the study door. One night the two girls woke up screaming, and on the nurse running up to them, the elder said she had seen a great black dog with fiery eyes resting its paws on her bed. Her father ordered the servants to sit constantly with them in the evenings, but, notwithstanding the presence of two women in the nursery, the same thing occurred. The younger daughter was so scared that she never quite recovered. The family left the house immediately."
    },
    {
      "text": "Apropos of ineradicable blood on a floor, which is a not infrequent item in stories of haunted houses, it is said that a manifestation of this nature forms the haunting in a farmhouse in Co. Limerick. According to our informants, a light must be kept burning in this house all night; if by any chance it is forgotten, or becomes quenched, in the morning the floor is covered with blood. The story is evidently much older than the house, but no traditional explanation is given."
    },
    {
      "text": "Mr. Patrick Ryan, of P--, Co. Limerick, gives us two stories as he heard them related by Mr. Michael O'Dwyer of the same place. The former is evidently a very strong believer in supernatural phenomena, but he realises how strong is the unbelief of many, and in support of his stories he gives names of several persons who will vouch for the truth of them. With a few alterations, we give the story in his own words: \"Mr. O'Dwyer has related how one night, after he had carried the mails to the train, he went with some fodder for a heifer in a field close to the railway station near to which was a creamery. He discovered the animal grazing near the creamery although how she came to be there was a mystery, as a broad trench separated it from the rest of the field, which is only spanned by a plank used by pedestrians when crossing the field. 'Perhaps,' he said in explanation, 'it was that he should go there to hear.' It was about a quarter to twelve (midnight), and, having searched the field in vain, he was returning home, when, as he crossed the plank, he espied the heifer browsing peacefully in the aforementioned part of the field which was near the creamery. He gave her the fodder and --Heavens! was he suffering from delusions? Surely his ears were not deceiving him--from the creamery funnel there arose a dense volume of smoke mingled with the sharp hissing of steam and the rattling of cans, all as if the creamery were working, and it were broad daylight. His heifer became startled and bellowed frantically. O'Dwyer, himself a man of nerves, yet possessing all the superstitions of the Celt, was startled and ran without ceasing to his home near by, where he went quickly to bed.\n\"O'Dwyer is not the only one who has seen this, as I have been told by several of my friends how they heard it. Who knows the mystery surrounding this affair!\""
    },
    {
      "text": "A curious vision, a case of second sight, in which a quite unimportant event, previously unknown, was revealed, is sent by the percipient, who is a lady well known to both the compilers, and a life-long friend of one of them. She says: \"Last summer I sent a cow to the fair of Limerick, a distance of about thirteen miles, and the men who took her there the day before the fair left her in a paddock for the night close to Limerick city. I awoke up very early next morning, and was fully awake when I saw (not with my ordinary eyesight, but apparently inside my head) a light, an intensely brilliant light, and in it I saw the back gate being opened by a red-haired woman and the cow I had supposed in the fair walking through the gate. I then knew that the cow must be home, and going to the yard later on I was met by the wife of the man who was in charge in a great state of excitement. 'Oh law! Miss,' she exclaimed, 'you'll be mad! Didn't Julia [a red-haired woman] find the cow outside the lodge gate as she was going out at 4 o'clock to the milking!' That's my tale--perfectly true, and I would give a good deal to be able to control that light, and see more if I could.\""
    }
  ],
  "placename": "County Limerick"
}