{
  "placeType": null,
  "references": [
    {
      "text": "The next case related by Professor Barrett occurred in County Fermanagh, at a spot eleven miles from Enniskillen and about two miles from the hamlet of Derrygonelly, where there dwelt a farmer and his family of four girls and a boy, of whom the eldest was a girl of about twenty years of age named Maggie. His cottage consisted of three rooms, the kitchen, or dwelling-room, being in the centre, with a room on each side used as bedrooms. In one of these two rooms Maggie slept with her sisters, and it was here that the disturbances occurred, generally after they had all gone to bed, when rappings and scratchings were heard which often lasted all night. Rats were first blamed, but when things were moved by some unseen agent, and boots and candles thrown out of the house, it was seen that something more than the ordinary rat was at work. The old farmer, who was a Methodist, sought advice from his class leader, and by his directions laid an open Bible on the bed in the haunted room, placing a big stone on the book. But the stone was lifted off by an\nunseen hand, the Bible moved out of the room, and seventeen pages torn out of it. They could not keep a lamp or candle in the house, so they went to their neighbours for help, and, to quote the old farmer's words to Professor Barrett, \"Jack Flanigan came and lent us a lamp, saying the devil himself would not steal it, as he had got the priest to sprinkle it with holy water.\" \"But that,\" the old man said, \"did us no good either, for the next day it took away that lamp also.\"\nProfessor Barrett, at the invitation of Mr. Thomas Plunkett of Enniskillen, went to investigate. He got a full account from the farmer of the freakish tricks which were continually being played in the house, and gives a graphic account of what he himself observed: \"After the children, except the boy, had gone to bed, Maggie lay down on the bed without undressing, so that her hands and feet could be observed. The rest of us sat round the kitchen fire, when faint raps, rapidly increasing in loudness, were heard coming apparently from the walls, the ceiling, and various parts of the inner room, the door of which was open. On entering the bedroom with a light the noises at first ceased, but recommenced when I put the light on the window-sill in the kitchen. I had the boy and his father by my side, and asked Mr. Plunkett to look round the house outside. Standing in the doorway leading to the bedroom, the noises recommenced, the light was gradually brought nearer, and after much patience I was able to bring the light into the bedroom whilst the disturbances were still loudly going on. At last I was able to go up to the side of the bed, with the lighted candle in my hand, and closely observed each of the occupants lying on the bed. The younger children were apparently asleep, and Maggie was motionless; nevertheless, knocks were going on everywhere around; on the chairs, the bedstead, the walls and ceiling. The closest scrutiny failed to detect any movement on the part of those present that could account for the noises, which were accompanied by a scratching or tearing sound. Suddenly a large pebble fell in my presence on to the bed; no one had moved to dislodge it, even if it had been placed for the purpose. When I replaced the candle on the window-sill in the kitchen, the knocks became still louder, like those made by a heavy carpenter's hammer driving nails into flooring.\"\nA couple of days afterwards, the Rev. Maxwell Close, M.A., a well-known member of the S.P.R., joined Professor Barrett and Mr. Plunkett, and together the party of three paid visits on two consecutive nights to the haunted farm-house, and the noises were repeated. Complete search was made, both inside and outside of the house, but no cause could be found. When the party were leaving, the old farmer was much perturbed that they had not \"laid the ghost.\" When questioned he said he thought it was fairies. He was asked if it had answered to questions by raps and he said he had; \"but it tells lies as often as truth, and oftener, I think. We tried it, and it only knocked at L M N when we said the alphabet over.\" Professor Barrett then tested it by asking mentally for a certain number of raps, and immediately the actual number was heard. He repeated this four times with a different number each time, and with the same result.\nPerhaps the most interesting part of this particular case is at the end of Professor Barrett's account, when, at the request of the old farmer, Mr. Maxwell Close read some passages from Scripture, followed by the Lord's Prayer, to an accompaniment of knockings and scratches, which were at first so loud that the solemn words could hardly be heard, but which gradually ceased as they all knelt in prayer. And since that night no further disturbance occurred."
    }
  ],
  "placename": "Derrygonnelly"
}