{
  "placeType": null,
  "references": [
    {
      "text": "Mr. T. J. Westropp, M.A., has furnished the following story: \"My maternal grandmother heard the following tradition from her mother, one of the Miss Ross-Lewins, who witnessed the occurrence. Their father, Mr. Harrison Ross-Lewin, was away in Dublin on law business, and in his absence the young people went off to spend the evening with a friend who lived some miles away. The night was fine and lightsome as they were returning, save at one point where the road ran between trees or high hedges not far to the west of the old church of Kilchrist. The latter, like many similar ruins, was a simple oblong building, with long side-walls and high gables, and at that time it and its graveyard were unenclosed, and lay in the open fields. As the party passed down the long dark lane they suddenly heard in the distance loud keening and clapping of hands, as the country-people were accustomed to do when lamenting the dead. The Ross-Lewins hurried on, and came in sight of the church, on the side wall of which a little gray-haired old woman, clad in a dark cloak, was running to and fro, chanting and wailing, and throwing up her arms. The girls were very frightened, but the young men ran forward and surrounded the ruin, and two of them went into the church, the apparition vanishing from the wall as they did so. They searched every nook, and found no one, nor did anyone pass out. All were now well scared, and got home as fast as possible. On reaching their home their mother opened the door, and at once told them that she was in terror about their father, for, as she sat looking out the window in the moonlight, a huge raven with fiery eyes lit on the sill, and tapped three times on the glass. They told her their story, which only added to their anxiety, and as they stood talking, taps came to the nearest window, and they saw the bird again. A few days later news reached them that Mr. Ross-Lewin had died suddenly in Dublin. This occurred about 1776.\"\nMr. Westropp also writes that the sister of a former Roman Catholic Bishop told his sisters that when she was a little girl she went out one evening with some other children for a walk. Going down the road, they passed the gate of the principal demesne near the town. There was a rock, or large stone, beside the road, on which they saw something. Going nearer, they perceived it to be a little dark, old woman, who began crying and clapping her hands. Some of them attempted to speak to her, but got frightened, and all finally ran home as quickly as they could. Next day the news came that the gentleman, near whose gate the Banshee had cried, was dead, and it was found on inquiry that he had died at the very hour at which the children had seen the spectre."
    }
  ],
  "placename": "Killcreest church"
}