{"placeType":null,"references":[{"text":"its being other than normal never entered the constables' heads till they had got into the barrack. When they found the door shut and bolted, their amazement was caused by indignation against an apparently unsociable or thoughtless comrade, and it was only afterwards, while discussing the whole thing on their homeward journey, that it occurred to them that it would have been impossible for any ordinary mortal to shut, bolt, and bar a door without making a sound.In the winter of 1840-1, in the days when snow and ice and all their attendant pleasures were more often in evidence than in these degenerate days, a skating party was enjoying itself on the pond in the grounds of the Castle near Rathfarnham, Co. Dublin. Among the skaters was a man who had with him a very fine curly-coated retriever dog. The pond was thronged with people enjoying themselves, when suddenly the ice gave way beneath him, and the man fell into the water; the dog went to his rescue, and both were drowned. A monument was erected to perpetuate the memory of the dog's heroic self-sacrifice, but only the pedestal now remains. The ghost of the[p. 127]dog is said to haunt the grounds and the public road between the castle gate and the Dodder Bridge. Many people have seen the phantom dog, and the story is well known locally.The ghost of a boy who was murdered by a Romany is said to haunt one of the lodge gates of the Castle demesne, and the lodge-keeper states that he saw it only a short time ago. The Castle, however, is now in possession of Jesuit Fathers, and the Superior assures us that there has been no sign of a ghost for a long time, his explanation being that the place is so crowded out with new buildings \"that even a ghost would have some difficulty in finding a comfortable corner.\"It is a fairly general belief amongst students of supernatural phenomena that animals have the psychic faculty developed to a greater extent than we have. There are numerous stories which tell of animals being scared and frightened by something that is invisible to a human being, and the explanation given is that the animal has seen a ghost which we cannot see. A story that is told of a certain spot near the village of[p. 128]"}],"placename":"RATHFARNHAM CASTLE"}