{
  "placeType": null,
  "references": [
    {
      "text": "\"True Irish Ghosts\" was written pre-partition of Ireland, so the town of Dun Laoghaire appears under its former name of \"Kingstown\".\nA haunted house in Kingstown, Co. Dublin, was investigated by Professor W. Barrett and Professor Henry Sidgwick. The story is singularly well attested (as one might expect from its being inserted in the pages of the Proceedings S.P.R. ), as the apparition was seen on three distinct occasions, and by three separate persons who were all personally known to the above gentlemen. The house in which the following occurrences took place is described as being a very old one, with unusually thick walls. The lady saw her strange visitant in her bedroom. She says: \"Disliking cross-lights, I had got into the habit of having the blind of the back window drawn and the shutters closed at night, and of leaving the blind raised and the shutters opened towards the front, liking to see the trees and sky when I awakened. Opening my eyes now one morning, I saw right before me (this occurred in July 1873) the figure of a woman, stooping down and apparently looking at me. Her head and shoulders were wrapped in a common woollen shawl; her arms were folded, and they were also wrapped, as if for warmth, in the shawl. I looked at her in my horror, and dared not cry out lest I might move the awful thing to speech or action. Behind her head I saw the window and the growing dawn, the looking-glass upon the toilet-table, and the furniture in that part of the room. After what may have been only seconds--of the duration of this vision I cannot judge--she raised herself and went backwards towards the window, stood at the toilet-table, and gradually vanished. I mean she grew by degrees transparent, and that through the shawl and the grey dress she wore I saw the white muslin of the table-cover again, and at last saw that only in the place where she had stood.\" The lady lay motionless with terror until the servant came to call her. The only other occupants of the house at the time were her brother and the servant, to neither of whom did she make any mention of the circumstance, fearing that the former would laugh at her, and the latter give notice.\nExactly a fortnight later, when sitting at breakfast, she noticed that her brother seemed out of sorts, and did not eat. On asking him if anything were the matter, he answered, \"I have had a horrid nightmare--indeed it was no nightmare: I saw it early this morning, just as distinctly as I see you.\" \"What?\" she asked. \"A villainous-looking hag,\" he replied, with her head and arms wrapped in a cloak, stooping over me, and looking like this--\" He got up, folded his arms, and put himself in the exact posture of the vision. Whereupon she informed him of what she herself had seen a fortnight previously.\nAbout four years later, in the same month, the lady's married sister and two children were alone in the house. The eldest child, a boy of about four or five years, asked for a drink, and his mother went to fetch it, desiring him to remain in the dining-room until her return. Coming back she met the boy pale and trembling, and on asking him why he left the room, he replied, \"Who is that woman--who is that woman?\" \"Where?\" she asked. \"That old woman who went upstairs,\" he replied. So agitated was he, that she took him by the hand and went upstairs to search, but no one was to be found, though he still maintained that a woman went upstairs. A friend of the family subsequently told them that a woman had been killed in the house many years previously, and that it was reported to be haunted."
    }
  ],
  "placename": "Dun Laoghaire (Kingstown)"
}