{
  "placeType": null,
  "references": [
    {
      "text": "But of all the death-warnings in connection with Irish families surely the strangest is the Gormanstown foxes. The crest of that noble family is a running fox, while the same animal also forms one of the supporters of the coat-of-arms. The story is, that when the head of the house is dying the foxes--not spectral foxes, but creatures of flesh and blood--leave the coverts and congregate at Gormanstown Castle.\nLet us see what proof there is of this. When Jenico, the 12th Viscount, was dying in 1860, foxes were seen about the house and moving towards the house for some days previously. Just before his death three foxes were playing about and making a noise close to the house, and just in front of the \"cloisters,\" which are yew-trees planted and trained in that shape. The Hon. Mrs. Farrell states as regards the same that the foxes came in pairs into the demesne, and sat under the Viscount's bedroom window, and barked and howled all night. Next morning they were to be found crouching about in the grass in front and around the house. They walked through the poultry and never touched them. After the funeral they disappeared.\nAt the death of Edward, the 13th Viscount, in 1876, the foxes were also there. He had been rather better one day, but the foxes appeared, barking under the window, and he died that night contrary to expectation.\nOn October 28, 1907, Jenico, the 14th Viscount, died in Dublin. About 8 o'clock that night the coachman and gardener saw two foxes near the chapel (close to the house), five or six more round the front of the house, and several crying in the \"cloisters.\" Two days later the Hon. Richard Preston, R.F.A., was watching by his father's body in the above chapel. About 3 A.M. he became conscious of a slight noise, which seemed to be that of a number of people walking stealthily around the chapel on the gravel walk. He went to the side door, listened, and heard outside a continuous and insistent snuffling or sniffing noise, accompanied by whimperings and scratchings at the door. On opening it he saw a full-grown fox sitting on the path within four feet of him. Just in the shadow was another, while he could hear several more moving close by in the darkness. He then went to the end door, opposite the altar, and on opening it saw two more foxes, one so close that he could have touched it with his foot. On shutting the door the noise continued till 5 A.M., when it suddenly ceased."
    }
  ],
  "placename": "Gormanstown Castle"
}