{
  "placeType": null,
  "references": [
    {
      "text": "This group may be brought to a conclusion by a story sent by Mr. T. MacFadden. It is not a personal experience, but happened to his father, and in an accompanying letter he states that he often heard the latter describe the incidents related therein, and that he certainly saw the ghost.\n\"The island of Inishinny, which is the scene of this story, is one of the most picturesque islands on the Donegal coast. With the islands of Gola and Inismaan it forms a perfectly natural harbour and safe anchorage for ships during storms. About Christmas some forty or fifty years ago a small sailing-ship put into Gola Roads (as this anchorage is called) during a prolonged storm, and the captain and two men had to obtain provisions from Bunbeg, as, owing to their being detained so long, their supply was almost exhausted. They had previously visited the island on several occasions, and made themselves at home with the people from the mainland who were temporarily resident upon it.\n\"The old bar at its best was never very safe for navigation, and this evening it was in its element, as with every storm it presented one boiling, seething mass of foam. The inhabitants of the island saw the frail small boat from the ship securely inside the bar, and prophesied some dire calamity should the captain and the two sailors venture to return to the ship that night. But the captain and his companions, having secured sufficient provisions, decided (as far as I can remember the story), even in spite of the entreaties of those on shore, to return to the ship. The storm was increasing, and what with their scanty knowledge of the intricacies of the channel, and the darkness of the night, certain it was the next morning their craft was found washed ashore on the island, and the body of the captain was discovered by the first man who made the round of the shore looking for logs of timber, or other useful articles washed ashore from wrecks. The bodies of the two sailors were never recovered, and word was sent immediately to the captain's wife in Derry, who came in a few days and gave directions for the disposal of her husband's corpse.\n\"The island was only temporarily inhabited by a few people who had cattle and horses grazing there for some weeks in the year, and after this catastrophe they felt peculiarly lonely, and sought refuge from their thoughts by all spending the evening together in one house. This particular evening they were all seated round the fire having a chat, when they heard steps approaching the door. Though the approach was fine, soft sand, yet the steps were audible as if coming on hard ground. They knew there was no one on the island save the few who were sitting quietly round the fire, and so in eager expectation they faced round to the door. What was their amazement when the door opened, and a tall, broad-shouldered man appeared and filled the whole doorway--and that man the captain who had been buried several days previously. He wore the identical suit in which he had often visited the island and even the \"cheese-cutter\" cap, so common a feature of sea-faring men's apparel, was not wanting. All were struck dumb with terror, and a woman who sat in a corner opposite the door, exclaimed in Irish in a low voice to my father:\n\"'O God! Patrick, there's the captain.'\n\"My father, recovering from the first shock, when he saw feminine courage finding expression in words, said in Irish to the apparition:\n\"'Come in!'\n\"They were so certain of the appearance that they addressed him in his own language, as they invariably talked Irish in the district in those days. But no sooner had he uttered the invitation than the figure, without the least word or sign, moved back, and disappeared from their view. They rushed out, but could discover no sign of any living person within the confines of the island. Such is the true account of an accident, by which three men lost their lives, and the ghostly sequel, in which one of them appeared to the eyes of four people, two of whom are yet alive, and can vouch for the accuracy of this narrative.\""
    }
  ],
  "placename": "Island of Inishinny"
}