{
  "placeType": null,
  "references": [
    {
      "text": "The same correspondent says; \"An old ruined house in the hills of east Co. Clare enjoyed the reputation of being 'desperately haunted' from, at any rate, 1865 down to its dismantling. I will merely give the experiences of my own relations, as told by them to me. My mother told how one night she and my father heard creaking and grating, as if a door were being forced open. The sound came from a passage in which was a door nailed up and clamped with iron bands. A heavy footstep came down the passage, and stopped at the bedroom door for a moment; no sound was heard, and then the 'thing' came through the room to the foot of the bed. It moved round the bed, they not daring to stir. The horrible unseen visitant stopped, and they felt it watching them. At last it moved away, they heard it going up the passage, the door crashed, and all was silence. Lighting a candle, my father examined the room, and found the door locked; he then went along the passage, but not a sound was to be heard anywhere.\n\"Strange noises like footsteps, sobbing, whispering, grim laughter, and shrieks were often heard about the house. On one occasion my eldest sister and a girl cousin drove over to see the family and stayed the night. They and my two younger sisters were all crowded into a huge, old-fashioned bed, and carefully drew and tucked in the curtains all round. My eldest sister awoke feeling a cold wind blowing on her face, and putting out her hand found the curtains drawn back and, as they subsequently discovered, wedged between the bed and the wall. She reached for the match-box, and was about to light the candle when a horrible mocking laugh rang out close to the bed, which awakened the other girls. Being always a plucky woman, though then badly scared, she struck a match, and searched the room, but nothing was to be seen. The closed room was said to have been deserted after a murder, and its floor was supposed to be stained with blood which no human power could wash out.\""
    },
    {
      "text": "An occurrence of very much the same description took place in County Clare about three years ago. Again the departed husband returns to his sorrowing wife, sits by the fire with her, chatting no doubt of old times, and before he leaves for the other world is regaled with pig's head and plenty of whisky. The visit is repeated the next night, and a request made for money to play cards with down below: the wife willingly gives him the money. Again he comes, and again he borrows on the plea that he had lost the night before, but hoped to get better luck next time. On the woman telling a neighbour a watch was kept for the dead man's return, but he never came near the place again."
    }
  ],
  "placename": "County Clare"
}