{
  "placeType": null,
  "references": [
    {
      "text": "In the year 1869 a ghost made its presence manifest in the house of a Mr. M-- in Co. Cavan. In the daytime it resided in the chimney, but at night it left its quarters and subjected the family to considerable annoyance. During the day they could cook nothing, as showers of soot would be sent down the chimney on top of every pot and pan that was placed on the fire. At night the various members of the family would be dragged out of bed by the hair, and pulled around the house. When anyone ventured to light a lamp it would immediately be put out, while chairs and tables would be sent dancing round the room. At last matters reached such a pitch that the family found it impossible to remain any longer in the house. The night before they left Mrs. M-- was severely handled, and her boots left facing the door as a gentle hint for her to be off. Before they departed some of the neighbours went to the house, saw the ghost, and even described to Mr. Thompson what they had seen. According to one man it appeared in the shape of a human being with a pig's head with long tusks. Another described it as a horse with an elephant's head, and a headless man seated on its back. Finally a \"station\" was held at the house by seven priests, at which all the neighbours attended. The station commenced after sunset, and everything in the house had to be uncovered, lest the evil spirit should find any resting-place. A free passage was left out of the door into the street, where many people were kneeling. About five minutes after the station opened a rumbling noise was heard, and a black barrel rolled out with an unearthly din, though to some coming up the street it appeared in the shape of a black horse with a bull's head, and a headless man seated thereon. From this time the ghost gave no further trouble.\nThe same gentleman also sends an account of a haunted shop in which members of his family had some very unpleasant experiences. \"In October 1882 my father, William Thompson, took over the grocery and spirit business from a Dr. S-- to whom it had been left by will. My sister was put in charge of the business, and she slept on the premises at night, but she was not there by herself very long until she found things amiss. The third night matters were made so unpleasant for her that she had to get up out of bed more dead than alive, and go across the street to Mrs. M--, the servant at the R.I.C. barrack, with whom she remained until the morning. She stated that as she lay in bed, half awake and half asleep, she saw a man enter the room, who immediately seized her by the throat and well-nigh choked her. She had only sufficient strength left to gasp 'Lord, save me!' when instantly the man vanished. She also said that she heard noises as if every bottle and glass in the shop was smashed to atoms, yet in the morning everything would be found intact. My brother was in charge of the shop one day, as my sister had to go to Belturbet to do some Christmas shopping. He expected her to return to the shop that night, but as she did not do so he was preparing to go to bed about 1 A.M., when suddenly a terrible noise was heard. The light was extinguished, and the tables and chairs commenced to dance about the floor, and some of them struck him on the shins. Upon this he left the house, declaring that he had seen the Devil!\" Possibly this ghost had been a rabid teetotaller in the flesh, and continued to have a dislike to the publican's trade after he had become discarnate. At any rate the present occupants, who follow a different avocation, do not appear to be troubled."
    }
  ],
  "placename": "County Cavan"
}