{
  "placeType": null,
  "references": [
    {
      "text": "Mrs. Acheson, of Co. Roscommon, sends the following: \"Emo House, Co. Westmeath,\na very old mansion since pulled down, was purchased by my grandfather for his son, my father. The latter had only been living in it for a few days when knocking commenced at the hall door. Naturally he thought it was someone playing tricks, or endeavouring to frighten him away. One night he had the lobby window open directly over the door. The knocking commenced, and he looked out: it was a very bright night, and as there was no porch he could see the door distinctly; the knocking continued, but he did not see the knocker move. Another night he sat up expecting his brother, but as the latter did not come he went to bed. Finally the knocking became so loud and insistent that he felt sure his brother must have arrived. He went downstairs and opened the door, but no one was there. Still convinced that his brother was there and had gone round to the yard to put up his horse, he went out; but scarcely had he gone twenty yards from the door when the knocking recommenced behind his back. On turning round he could see no one.\"\n\"After this the knocking got very bad, so much so that he could not rest. All this time he did not mention the strange occurrence to anyone. One morning he went up through the fields between four and five o'clock. To his surprise he found the herd out feeding the cattle. My father asked him why he was up so early. He replied that he could not sleep. 'Why?' asked my father. 'You know why yourself, sir --the knocking.' He then found that this man had heard it all the time, though he slept at the end of a long house. My father was advised to take no notice of it, for it would go as it came, though at this time it was continuous and very loud; and so it did. The country people said it was the late resident who could not rest.\"\n\"We had another curious and most eerie experience in this house. A former rector was staying the night with us, and as the evening wore on we commenced to tell ghost-stories. He related some remarkable experiences, and as we were talking the drawing-room door suddenly opened as wide as possible, and then slowly closed again. It was a calm night, and at any rate it was a heavy double door which never flies open however strong the wind may be blowing. Everyone in the house was in bed, as it was after 12 o'clock, except the three persons who witnessed this, viz. myself, my daughter, and the rector. The effect on the latter was most marked. He was a big, strong, jovial man and a good athlete, but when he saw the door open he quivered like an aspen leaf.\""
    }
  ],
  "placename": "County Westmeath"
}