{
  "placeType": null,
  "references": [
    {
      "text": "Here is another story of a haunted spot on a road, where a \"ghost\" was seen, not at the witching hour of night, not when evening shadows lengthen, but in broad daylight. It is sent to us by the percipient, a lady, who does not desire to have her name mentioned. She was walking along a country road in the vicinity of Cork one afternoon, and passed various people. She then saw coming towards her a country-woman dressed in an old-fashioned style. This figure approached her, and when it drew near, suddenly staggered, as if under the influence of drink, and disappeared! She hastened to the spot, but searched in vain for any clue to the mystery; the road was bounded by high walls, and there was no gateway or gap through which the figure might slip. Much mystified, she continued on her way, and arrived at her destination. She there mentioned what had occurred, and was then informed by an old resident in the neighbourhood that that woman had constantly been seen up to twenty years before, but not since that date. By the country-people the road was believed to be haunted, but the percipient did not know this at the time."
    },
    {
      "text": "The following portent occurs in a Co. Cork family. At one time the lady of the house lay ill, and her two daughters were aroused one night by screams proceeding from their mother's room. They rushed in, and found her sitting up in bed, staring at some object unseen to them, but which, from the motion of her eyes, appeared to be moving across the floor. When she became calm she told them, what they had not known before, that members of the family were sometimes warned of the death, or approaching death, of some other member by the appearance of a ball of fire, which would pass slowly through the room; this phenomenon she had just witnessed. A day or two afterwards the mother heard of the death of her brother, who lived in the Colonies."
    }
  ],
  "placename": "County Cork"
}