{
  "placeType": null,
  "references": [
    {
      "text": "Lord Walter Fitzgerald sends us the following: \"Garrett oge\" (or Gerald the younger) Fitzgerald, 11th Earl of Kildare, died in London on the 16th November 1585; his body was brought back to Ireland and interred in St. Brigid's Cathedral, in Kildare. He was known as 'the Wizard Earl' on account of his practising the black art, whereby he was enabled to transform himself into other shapes, either bird or beast according to his choice; so notorious was his supernatural power that he became the terror of the countryside.\n\"His wife, the Countess, had long wished to see some proof of his skill, and had frequently begged him to transform himself before her, but he had steadily refused to do so, as he said if he did and she became afraid, he would be taken from her, and she would never see him again. Still she persisted, and at last he said he would do as she wished on condition that she should first of all undergo three trials to test her courage; to this she willingly agreed. In the first trial the river Greese, which flows past the castle walls, at a sign from the Earl overflowed its banks and flooded the banqueting hall in which the Earl and Countess were sitting. She showed no sign of fear, and at the Earl's command the river receded to its normal course. At the second trial a huge eel-like monster appeared, which entered by one of the windows, crawled about among the furniture of the banqueting hall, and finally coiled itself round the body of the Countess. Still she showed no fear, and at a nod from the Earl the animal uncoiled itself and disappeared. In the third test an intimate friend of the Countess, long since dead, entered the room, and passing slowly by her went out at the other end. She showed not the slightest sign of fear, and the Earl felt satisfied that he could place his fate in her keeping, but he again warned her of his danger if she lost her presence of mind while he was in another shape. He then turned himself into a black bird, flew about the room, and perching on the Countess's shoulder commenced to sing. Suddenly a black cat appeared from under a chest, and made a spring at the bird; in an agony of fear for its safety the Countess threw up her arms to protect it and swooned away. When she came to she was alone, the bird and the cat had disappeared, and she never saw the Earl again.\"\nIt is said that he and his knights lie in an enchanted sleep, with their horses beside them, in a cave under the Rath on the hill of Mullaghmast, which stands, as the crow flies, five miles to the north of Kilkea Castle. Once in seven years they are allowed to issue forth; they gallop round the Curragh, thence across country to Kilkea Castle, where they re-enter the haunted wing, and then return to the Rath of Mullaghmast. The Earl is easily recognised as he is mounted on a white charger shod with silver shoes; when these shoes are worn out the enchantment will be broken, and he will issue forth, drive the foes of Ireland from the land, and reign for a seven times seven number of years over the vast estates of his ancestors.\nShortly before '98 he was seen on the Curragh by a blacksmith who was crossing it in an ass-cart from Athgarvan to Kildare. A fairy blast overtook him, and he had just time to say, \"God speed ye Gentlemen\" to the invisible \"Good People,\" when he heard horses galloping up behind him; pulling to one side of the road he looked back and was terrified at seeing a troop of knights, fully armed, led by one on a white horse. The leader halted his men, and riding up to the blacksmith asked him to examine his shoes. Almost helpless from fear he stumbled out of the ass-cart and looked at each shoe, which was of silver, and then informed the knight that all the nails were sound. The knight thanked him, rejoined his troop, and galloped off. The blacksmith in a half-dazed state hastened on to Kildare, where he entered a public-house, ordered a noggin of whisky, and drank it neat. When he had thoroughly come to himself he told the men that were present what had happened to him on the Curragh; one old man who had listened to him said: \"By the mortial! man, ye are after seeing 'Gerod Earla.'\" This fully explained the mystery. Gerod Earla, or Earl Gerald, is the name by which the Wizard Earl is known by the peasantry.\nOne other legend is told in connection with the Wizard Earl of a considerably later date. It is said that a farmer was returning from a fair in Athy late one evening in the direction of Ballintore, and when passing within view of the Rath of Mullaghmast he was astonished to see a bright light apparently issuing from it. Dismounting from his car he went to investigate. On approaching the Rath he noticed that the light was proceeding from a cave in which were sleeping several men in armour, with their horses beside them. He cautiously crept up to the entrance, and seeing that neither man nor beast stirred he grew bolder and entered the chamber; he then examined the saddlery on the horses, and the armour of the men, and plucking up courage began slowly to draw a sword from its sheath; as he did so the owner's head began to rise, and he heard a voice in Irish say, \"Is the time yet come?\" In terror the farmer, as he shoved the sword back, replied, \"It is not, your Honour,\" and then fled from the place.\nIt is said that if the farmer had only completely unsheathed the sword the enchantment would have been broken, and the Earl would have come to his own again."
    }
  ],
  "placename": "Rath of Mullaghmast"
}