{
  "placeType": null,
  "references": [
    {
      "text": "Mr. Joseph M'Crossan, a journalist on the staff of the Strabane Chronicle, has sent us a cutting from that paper describing a ghost which appeared to men working in an engine-house at Strabane railway station on two successive nights in October 1913. The article depicts very graphically the antics of the ghost and the fear of the men who saw it. Mr. M'Crossan interviewed one of these men (Pinkerton by name), and the story as told in his words is as follows: \"Michael Madden, Fred Oliphant, and I were engaged inside a shed cleaning engines, when, at half-past twelve (midnight),a knocking came to all the doors, and continued without interruption, accompanied by unearthly yells. The three of us went to one of the doors, and saw--I could swear to it without doubt--the form of a man of heavy build. I thought I was about to faint. My hair stood high on my head. We all squealed for help, when the watchman and signalman came fast to our aid. Armed with a crowbar, the signalman made a dash at the 'spirit,' but was unable to strike down the ghost, which hovered about our shed till half-past two. It was moonlight, and we saw it plainly. There was no imagination on our part. We three cleaners climbed up the engine, and hid on the roof of the engine, lying there till morning at our wit's end. The next night it came at half-past one. Oliphant approached the spirit within two yards, but he then collapsed, the ghost uttering terrible yells. I commenced work, but the spirit 'gazed' into my face, and I fell forward against the engine. Seven of us saw the ghost this time. Our clothes and everything in the shed were tossed and thrown about.\"\nThe other engine-cleaners were interviewed and corroborated Pinkerton's account. One of them stated that he saw the ghost run up and down a ladder leading to a water tank and disappear into it, while the signalman described how he struck at the ghost with a crowbar, but the weapon seemed to go through it. The spirit finally took his departure through the window.\nThe details of this affair are very much on the lines of the good old-fashioned ghost yarns. But it is hard to see how so many men could labour under the same delusion. The suggestion that the whole thing was a practical joke may also be dismissed, for if the apparition had flesh and bones the crowbar would have soon proved it. The story goes that a man was murdered near the spot some time ago; whether there is any connection between this crime and the apparition it would be hard to say. However, we are not concerned with explanations (for who, as yet, can explain the supernatural?); the facts as stated have all the appearance of truth."
    }
  ],
  "placename": "STRABANE"
}