{"placeType":null,"references":["asked him if they changed house would he trouble them. He replied, \"No! but if they throw down this house, I will trouble the stones.\"At last Mrs. A-- appealed to him to keep quiet, and not to injure people who had never injured him. He promised that he would do so, and then said, \"Mrs. A--, you will be all right now, for I see a lady in black coming up the street to this house, and she will buy it.\" Within half an hour a widow called and purchased the house. Possibly Corney is still there, for our informant looked up the Directory as he was writing, and found the house marked \"Vacant.\"Near Blanchardstown, Co. Dublin, is a house, occupied at present, or up to very recently, by a private family; it was formerly a monastery, and there are said to be secret passages in it. Once a servant ironing in the kitchen saw the figure of a nun approach the kitchen window and look in. Our informant was also told by a friend (now dead), who had it from the lady of the house, that once night falls, no doors can be kept closed. If anyone shuts them, almost immediately they are flung open again with the greatest[p. 28]violence and apparent anger. If left open there is no trouble or noise, but light footsteps are heard, and there is a vague feeling of people passing to and fro. The persons inhabiting the house are matter-of-fact, unimaginative people, who speak of this as if it were an everyday affair. \"So long as we leave the doors unclosed they don't harm us: why should we be afraid of them?\" Mrs. -- said. Truly a most philosophical attitude to adopt!A haunted house in Kingstown, Co. Dublin, was investigated by Professor W. Barrett and Professor Henry Sidgwick. The story is singularly well attested (as one might expect from its being inserted in the pages of the Proceedings S.P.R. [*1]), as the apparition was seen on three distinct occasions, and by three separate persons who were all personally known to the above gentlemen. The house in which the following occurrences took place is described as being a very old one, with unusually thick walls. The lady saw her strange visitant in her bedroom. She says: \"Disliking cross-lights, I had got into the habit[p. 29]"],"placename":"Blanchardstown"}