{"placeType":null,"references":["the room remained in semi-darkness. I called out in amazement, 'What has happened to the chair?' In a moment the light vanished, and the chair was as before. In the morning I heard that my cousin had died about the same time that I saw the light.\"We now come to the ordinary type, i.e. where a figure appears. The following tale illustrates a point we have already alluded to, namely, that the apparition is sometimes seen by a disinterested person, and not by those whom one would naturally expect should see it. A lady writes as follows: \"At Island Magee is the Knowehead Lonan, a long, hilly, narrow road, bordered on either side by high thorn-hedges and fields. Twenty years ago, when I was a young girl, I used to go to the post-office at the Knowehead on Sunday mornings down the Lonan, taking the dogs for the run. One Sunday as I had got to the top of the hill on my return journey, I looked back, and saw a man walking rapidly after me, but still a good way off. I hastened my steps, for the day was muddy, and I did not want him to see me in a bedraggled state. But[p. 153]he seemed to come on so fast as to be soon close behind me, and I wondered he did not pass me, so on we went, I never turning to look back. About a quarter of a mile farther on I met A. B. on 'Dick's Brae,' on her way to church or Sunday school, and stopped to speak to her. I wanted to ask who the man was, but he seemed to be so close that I did not like to do so, and expected he had passed. When I moved on, I was surprised to find he was still following me, while my dogs were lagging behind with downcast heads and drooping tails.\"I then passed a cottage where C. D. was out feeding her fowls. I spoke to her, and then feeling that there was no longer anyone behind, looked back, and saw the man standing with her. I would not have paid any attention to the matter had not A. B. been down at our house that afternoon, and I casually asked her:\"'Who was the man who was just behind me when I met you on Dick's Brae?'\"'What man?' said she; and noting my look of utter astonishment, added, 'I give you my word I never met a soul but yourself[p. 154]"],"placename":"Island Magee"}