{"placeType":null,"references":["  CHAPTER III  HAUNTED HOUSES IN MOGH'S HALFTHE northern half of Ireland has not proved as prolific in stories of haunted houses as the southern portion: the possible explanation of this is, not that the men of the north are less prone to hold, or talk about, such beliefs, but that, as regards the south half, we have had the good fortune to happen upon some diligent collectors of these and kindred tales, whose eagerness in collecting is only equalled by their kindness in imparting information to the compilers of this book.On a large farm near Portarlington there once lived a Mrs.--, a strong-minded, capable woman, who managed all her affairs for herself, giving her orders, and taking none from anybody. In due time she died, and the property passed to the next-of-kin. As soon, however, as the funeral was over, the house was nightly disturbed by strange noises: people downstairs would hear rushings[p. 56]about in the upper rooms, banging of doors, and the sound of heavy footsteps. The cups and saucers used to fall off the dresser, and all the pots and pans would rattle.This went on for some time, till the people could stand it no longer, so they left the house and put in a herd and his family. The latter was driven away after he had been in the house a few weeks. This happened to several people, until at length a man named Mr. B-- took the house. The noises went on as before until some one suggested getting the priest in. Accordingly the priest came, and held a service in the late Mrs. --'s bedroom. When this was over, the door of the room was locked. After that the noises were not heard till one evening Mr. B-- came home from a fair, fortified, no doubt, with a little \"Dutch courage,\" and declared that even if the devil were in it he would go into the locked room. In spite of all his family could say or do, he burst open the door, and entered the room, but apparently saw nothing. That night pandemonium reigned in the house, the chairs were hurled about, the china was[p. 57]","broken, and the most weird and uncanny sounds were heard. Next day the priest was sent for, the room again shut up, and nothing has happened from that day to this.Another strange story comes from the same town. \"When I was on a visit to a friend in Portarlington,\" writes a lady in the Journal of the American S.P.R. [*1] \"a rather unpleasant incident occurred to me. At about two o'clock in the morning I woke up suddenly, for apparently no reason whatever; however, I quite distinctly heard snoring coming from under or in the bed in which I was lying. It continued for about ten minutes, during which time I was absolutely limp with fright. The door opened, and my friend entered the bedroom, saying, 'I thought you might want me, so I came in.' Needless to say, I hailed the happy inspiration that sent her to me. I then told her what I had heard; she listened to me, and then to comfort (!) me said, 'Oh, never mind; it is only grandfather! He died in this room, and a snoring is heard every night at two o'clock, the hour at which he passed away.' Some time previously a German[p. 58]gentleman was staying with this family. They asked him in the morning how he had slept, and he replied that he was disturbed by a snoring in the room, but he supposed it was the cat.\"A lady, formerly resident in Queen's Co., but who now lives near Dublin, sends the following clear and concise account of her own personal experiences in a haunted house: \"Some years ago, my father, mother, sister, and myself went to live in a nice but rather small house close to the town of -- in Queen's Co. We liked the house, as it was conveniently and pleasantly situated, and we certainly never had a thought of ghosts or haunted houses, nor would my father allow any talk about such things in his presence. But we were not long settled there when we were disturbed by the opening of the parlour door every night regularly at the hour of eleven o'clock. My father and mother used to retire to their room about ten o'clock, while my sister and I used to sit up reading. We always declared that we would retire before the door opened, but we generally got so interested in our books that we would forget until we would hear the handle of[p. 59]","the substantial accuracy of what I have stated above.\"Professor Barrett, in the paper to which we have already referred, draws certain conclusions from his study of this subject; one of the chief of these is that \"the widespread belief in fairies, pixies, gnomes, brownies, &c., probably rests on the varied manifestations of poltergeists.\" The popular explanation of the above story bears out this conclusion, and it is further emphasized by the following, which comes from Portarlington: A man near that town had saved five hundred pounds, and determined to build a house with the money. He fixed on a certain spot, and began to build, very much against the advice of his friends, who said it was on a fairy path, and would bring him ill-luck. Soon the house was finished, and the owner moved in; but the very first night his troubles began, for some unseen hand threw the furniture about and broke it, while the man himself was injured. Being unwilling to lose the value of his money, he tried to make the best of things. But night after night the disturbances continued, and life in the house was impossible; the[p. 119]owner chose the better part of valour and left. No tenant has been found since, and the house stands empty, a silent testimony to the power of the poltergeist.Poltergeistic phenomena from their very nature lend themselves to spurious reproduction and imitation, as witness the famous case of Cock Lane and many other similar stories. At least one well-known case occurred in Ireland, and is interesting as showing that where fraud is at work, close investigation will discover it. It is related that an old Royal Irish Constabulary pensioner, who obtained a post as emergency man during the land troubles, and who in 1892 was in charge of an evicted farm in the Passage East district, was being continually disturbed by furniture and crockery being thrown about in a mysterious manner. Reports were brought to the police, and they investigated the matter; but nothing was heard or seen beyond knocking on an inside wall of a bedroom in which one of the sons was sleeping; this knocking ceased when the police were in the bedroom, and no search was made in the boy's bed to see if he had a stick. The police therefore[p. 120]"],"placename":"Portarlington"}