{"placeType":null,"references":["always when the light was put out she heard strange noises, as if some one was going round the room rubbing paper along the wall, while she often had the feeling that a person was standing beside her bed. A cousin, who was a nurse, once slept with her, and also noticed these strange noises. On one occasion this room was given up to a very matter-of-fact young man to sleep in, and next morning he said that the room was very strange, with queer noises in it.Her mother also had an extraordinary experience in the same house. One evening she had just put the baby to bed, when she heard a voice calling \"mother.\" She left the bedroom, and called to her daughter, who was in a lower room, \"What do you want?\" But the girl replied that she had not called her; and then, in her turn, asked her mother if she had been in the front room, for she had just heard a noise as if some one was trying to fasten the inside bars of the shutters across. But her mother had been upstairs, and no one was in the front room. The experiences in the Rathmines house were of a similar auditory nature, i.e. the young ladies heard their names called,[p. 20]though it was found that no one in the house had done so.Occasionally it happens that ghosts inspire a law-suit. In the seventeenth century they were to be found actively urging the adoption of legal proceedings, but in the nineteenth and twentieth centuries they play a more passive part. A case about a haunted house took place in Dublin in the year 1885, in which the ghost may be said to have won. A Mr. Waldron, a solicitor's clerk, sued his next-door neighbour, one Mr. Kiernan, a mate in the merchant service, to recover L500 for damages done to his house.Kiernan altogether denied the charges, but asserted that Waldron's house was notoriously haunted. Witnesses proved that every night, from August 1884 to January 1885, stones were thrown at the windows and doors, and extraordinary and inexplicable occurrences constantly took place.Mrs. Waldron, wife of the plaintiff, swore that one night she saw one of the panes of glass of a certain window cut through with a diamond, and a white hand inserted through the hole. She at once caught up[p. 21]"],"placename":"Rathmines"}