{"placeType":null,"references":["cathedral since his death. He hurried back to the afternoon service, and asked the robestress if anybody had seen Canon --'s ghost. She informed him that she had, and that he had also been seen by one of the sextons in the cathedral. I mention this because in describing his personal appearance she had remarked the same change as I had with regard to the beard.\"Some years ago a family had very uncanny experiences in a house in Rathgar, and subsequently in another in Rathmines. These were communicated by one of the young ladies to Mrs. M. A. Wilkins, who published them in the Journal of the American S.P.R., [*1] from which they are here taken. The Rathgar house had a basement passage leading to a door into the yard, and along this passage her mother and the children used to hear dragging, limping steps, and the latch of the door rattling, but no one could ever be found when search was made. The house-bells were old and all in a row, and on one occasion they all rang, apparently of their own accord. The lady narrator used to sleep in the back drawing room, and[p. 19]always when the light was put out she heard strange noises, as if some one was going round the room rubbing paper along the wall, while she often had the feeling that a person was standing beside her bed. A cousin, who was a nurse, once slept with her, and also noticed these strange noises. On one occasion this room was given up to a very matter-of-fact young man to sleep in, and next morning he said that the room was very strange, with queer noises in it.Her mother also had an extraordinary experience in the same house. One evening she had just put the baby to bed, when she heard a voice calling \"mother.\" She left the bedroom, and called to her daughter, who was in a lower room, \"What do you want?\" But the girl replied that she had not called her; and then, in her turn, asked her mother if she had been in the front room, for she had just heard a noise as if some one was trying to fasten the inside bars of the shutters across. But her mother had been upstairs, and no one was in the front room. The experiences in the Rathmines house were of a similar auditory nature, i.e. the young ladies heard their names called,[p. 20]"],"placename":"Rathgar"}