{"placeType":null,"references":["he was astonished to see a bright light apparently issuing from it. Dismounting from his car he went to investigate. On approaching the Rath he noticed that the light was proceeding from a cave in which were sleeping several men in armour, with their horses beside them. He cautiously crept up to the entrance, and seeing that neither man nor beast stirred he grew bolder and entered the chamber; he then examined the saddlery on the horses, and the armour of the men, and plucking up courage began slowly to draw a sword from its sheath; as he did so the owner's head began to rise, and he heard a voice in Irish say, \"Is the time yet come?\" In terror the farmer, as he shoved the sword back, replied, \"It is not, your Honour,\" and then fled from the place.It is said that if the farmer had only completely unsheathed the sword the enchantment would have been broken, and the Earl would have come to his own again.In 1642 Wallstown Castle, the seat of the Wall family, in County Cork, was burnt down by the Cromwellian troops, and Colonel[p. 229][paragraph continues] Wall, the head of the family, was captured and imprisoned in Cork jail, where he died. One of the defenders during the siege was a man named Henry Bennett, who was killed while fighting. His ghost was often seen about the place for years after his death. His dress was of a light colour, and he wore a white hat, while in his hand he carried a pole, which he used to place across the road near the Castle to stop travellers; on a polite request to remove the pole he would withdraw it, and laugh heartily. A caretaker in the place named Philip Coughlan used frequently to be visited by this apparition. He came generally about supper time, and while Coughlan and his wife were seated at table he would shove the pole through the window; Coughlan would beg him to go away and not interfere with a poor hard-worked man; the pole would then be withdrawn, with a hearty laugh from the ghost.In the Parish Church of Ardtrea, near Cookstown, is a marble monument and inscription in memory of Thomas Meredith, D.D., who had been a Fellow of Trinity College, Dublin, and for six years rector of[p. 230]"],"placename":"WALLSTOWN CASTLE"}