{"placeType":null,"references":["and shiver at the thought of having to pass through a churchyard at dead of night, It may be some encouragement to such to state that out of a fairly large collection of accounts of haunted places, only one relates to a churchyard. The story is told by Mr. G. H. Millar of Edgeworthstown: \"During the winter of 1875,\" he writes, \"I attended a soiree about five miles from here. I was riding, and on my way home about 11.30 P.M. I had to pass by the old ruins and burial-ground of Abbeyshrule. The road led round by two sides of the churchyard. It was a bright moonlight night, and as my girth broke I was walking the horse quite slowly. As I passed the ruin, I saw what I took to be a policeman in a long overcoat; he was walking from the centre of the churchyard towards the corner, and, as far as I could see, would be at the corner by the time I would reach it, and we would meet. Quite suddenly, however, he disappeared, and I could see no trace of him. Soon after I overtook a man who had left the meeting long before me. I expressed wonder that he had not been farther on, and he explained that he went a 'round-about'[p. 135]way to avoid passing the old abbey, as he did not want to see 'The Monk.' On questioning him, he told me that a monk was often seen in the churchyard.\"A story told of a ghost which haunts a certain spot on an estate near the city of Waterford, bears a certain resemblance to the last story for the reason that it was only after the encounter had taken place in both cases that it was known that anything out of the ordinary had been seen. In the early eighties of last century -- Court, near Waterford, was occupied by Mr. and Mrs. S-- and their family of two young boys and a girl of twenty-one years of age. Below the house is a marshy glen with a big open drain cut through it. Late one evening the daughter was out shooting rabbits near this drain and saw, as she thought, her half-brother standing by the drain in a sailor suit, which like other small boys he wore. She called to him once or twice, end to her surprise got no reply. She went towards him, and when she got close he suddenly disappeared. The next day she asked an old dependent, who had lived many years in the place, if there was anything[p. 136]"],"placename":"ABBEYSHRULE"}