{"placeType":null,"references":["[paragraph continues] Wall, the head of the family, was captured and imprisoned in Cork jail, where he died. One of the defenders during the siege was a man named Henry Bennett, who was killed while fighting. His ghost was often seen about the place for years after his death. His dress was of a light colour, and he wore a white hat, while in his hand he carried a pole, which he used to place across the road near the Castle to stop travellers; on a polite request to remove the pole he would withdraw it, and laugh heartily. A caretaker in the place named Philip Coughlan used frequently to be visited by this apparition. He came generally about supper time, and while Coughlan and his wife were seated at table he would shove the pole through the window; Coughlan would beg him to go away and not interfere with a poor hard-worked man; the pole would then be withdrawn, with a hearty laugh from the ghost.In the Parish Church of Ardtrea, near Cookstown, is a marble monument and inscription in memory of Thomas Meredith, D.D., who had been a Fellow of Trinity College, Dublin, and for six years rector of[p. 230]the parish. He died, according to the words of the , on 2nd May 1819, as a result of \"a sudden and awful visitation.\" A local legend explains this \"visitation,\" by stating that a ghost haunted the rectory, the visits of which had caused his family and servants to leave the house. The rector had tried to shoot it but failed; then he was told to use a silver bullet; he did so, and next morning was found dead at his hall-door while a hideous object like a devil made horrid noises out of any window the servant man approached. This man was advised by some Roman Catholic neighbours to get the priest, who would \"lay\" the thing. The priest arrived, and with the help of a jar of whisky the ghost became quite civil, till the last glass in the jar, which the priest was about to empty out for himself, whereupon the ghost or devil made himself as thin and long as a Lough Neagh eel, and slipped himself into the jar to get the last drops. But the priest put the cork into its place and hammered it in, and, making the sign of the Cross on it, he had the evil thing secured. It was buried in the cellar of the rectory, where on some[p. 231]"],"placename":"Ardtrea"}