{"placeType":null,"references":["he comes, and again he borrows on the plea that he had lost the night before, but hoped to get better luck next time. On the woman telling a neighbour a watch was kept for the dead man's return, but he never came near the place again.An account of a police-court trial which appeared in the Irish Times of 31st December 1913 emphasizes in a very marked degree the extraordinary grip that superstition has over some of the country people. A young woman was on her trial for stealing L300 from the brother of her employer, Patrick McFaul of Armagh. District Inspector Lowndes, in opening the case for the Crown, told the bench that the money had been taken out of the bank by McFaul to buy a holding, for the purchase of which negotiations were going on. The money was carelessly thrown into a drawer in a bedroom, and left there till it would be wanted. A short time afterwards a fire broke out in the room, and a heap of ashes was all that was found in the drawer, though little else in the room besides a few clothes was injured. \"The McFauls appeared to accept their loss with a complacency,[p. 258]which could only be accounted for by the idea they entertained that the money was destroyed through spiritual intervention--that there were ghosts in the question, and that the destruction of the money was to be taken as a warning directed against a matrimonial arrangement, into which Michael McFaul was about to enter.\" The accused girl was servant to the McFauls, who discharged her a few days after the fire: but before this she had been into Derry and spent a night there; during her stay she tried to change three L20 notes with the help of a friend. But change was refused, and she had to abandon the attempt. \"If some of the money was burned, some of it was certainly in existence three days later, to the amount of L60. One thing was manifest, and that was that an incredible amount of superstition appeared to prevail amongst families in that neighbourhood when the loss of such a sum as this could be attributed to anything but larceny, and it could for a moment be suggested that it was due to spiritual intervention to indicate that a certain course should be abandoned.\"[p. 259]"],"placename":"Armagh"}