{"placeType":null,"references":["worthy of note is the fact that the hauntings of a poltergeist are generally attached to a certain individual in a certain spot, and thus differ from the operations of an ordinary ghost.The two following incidents related in this chapter are taken from a paper read by Professor Barrett, F.R.S., before the Society for Psychical Research. [*1] In the case of the first anecdote he made every possible inquiry into the facts set forth, short of actually being an eye-witness of the phenomena. In the case of the second he made personal investigation, and himself saw the whole of the incidents related. There is therefore very little room to doubt the genuineness of either story.In the year 1910, in a certain house in Court Street, Enniscorthy, there lived a labouring man named Redmond. His wife took in boarders to supplement her husband's wages, and at the time to which we refer there were three men boarding with her, who slept in one room above the kitchen. The house consisted of five rooms--two on the ground-floor, of which one was a shop[p. 102]and the other the kitchen. The two other rooms upstairs were occupied by the Redmonds and their servant respectively. The bedroom in which the boarders slept was large, and contained two beds, one at each end of the room, two men sleeping in one of them; John Randall and George Sinnott were the names of two, but the name of the third lodger is not known--he seems to have left the Redmonds very shortly after the disturbances commenced.It was on July 4, 1910, that John Randall, who is a carpenter by trade, went to live at Enniscorthy, and took rooms with the Redmonds. In a signed statement, now in possession of Professor Barrett, he tells a graphic tale of what occurred each night during the three weeks he lodged in the house, and as a result of the poltergeist's attentions he lost three-quarters of a stone in weight. It was on the night of Thursday, July 7, that the first incident occurred, when the bedclothes were gently pulled off his bed. Of course he naturally thought it was a joke, and shouted to his companions to stop. As no one could explain what was happening, a match was struck,[p. 103]"],"placename":"ENNISCORTHY"}