{"placeType":null,"references":["[paragraph continues] Barrett's account, when, at the request of the old farmer, Mr. Maxwell Close read some passages from Scripture, followed by the Lord's Prayer, to an accompaniment of knockings and scratches, which were at first so loud that the solemn words could hardly be heard, but which gradually ceased as they all knelt in prayer. And since that night no further disturbance occurred.Another similar story comes from the north of Ireland. In the year 1866 (as recorded in the Larne Reporter of March 31 in that year), two families residing at Upper Ballygowan, near Larne, suffered a series of annoyances from having stones thrown into their houses both by night and by day. Their neighbours came in great numbers to sympathise with them in their affliction, and on one occasion, after a volley of stones had been poured into the house through the window, a young man who was present fired a musket in the direction of the mysterious assailants. The reply was a loud peal of satanic laughter, followed by a volley of stones and turf. On another occasion a heap of potatoes, which was in an inner apartment of one of the houses, was seen to be in commotion,[p. 114]and shortly afterwards its contents were hurled into the kitchen, where the inmates of the house, with some of their neighbours, were assembled.The explanation given by some people of this mysterious affair was as mysterious as the affair itself. It was said that many years before the occurrences which we have now related took place, the farmer who then occupied the premises in which they happened was greatly annoyed by mischievous tricks which were played upon him by a company of fairies who had a habit of holding their rendezvous in his house. The consequence was that this man had to leave the house, which for a long time stood a roofless ruin. After the lapse of many years, and when the story about the dilapidated fabric having been haunted had probably been forgotten, the people who then occupied the adjoining lands unfortunately took some of the stones of the old deserted mansion to repair their own buildings. At this the fairies, or \"good people,\" were much incensed; and they vented their displeasure on the offender in the way we have described.[p. 115]"],"placename":"LARNE"}