{
  "placeType": null,
  "references": [
    {
      "text": "An account of a dream which implied an extraordinary coincidence, if coincidence it be and nothing more, was sent as follows by a correspondent, who requested that no names be published. \"That which I am about to relate has a peculiar interest for me, inasmuch as the central figure in it was my own grand-aunt, and moreover the principal witness (if I may use such a term) was my father. At the period during which this strange incident occurred my father was living with his aunt and some other relatives. \n\"One morning at the breakfast-table, my grand-aunt announced that she had had a most peculiar dream during the previous night. My father, who was always very interested in that kind of thing, took down in his notebook all the particulars concerning it. They were as follows.\n\"My grand-aunt dreamt that she was in a cemetery, which she recognised as Glasnevin, and as she gazed at the memorials of the dead which lay so thick around, one stood out most conspicuously, and caught her eye, for she saw clearly cut on the cold white stone an inscription bearing her own name:\nCLARE * S * D--\nDied 14th of March, 1873\nDearly loved and ever mourned.\nR*I*P*\nwhile, to add to the peculiarity of it, the date on the stone as given above was, from the day of her dream, exactly a year in advance.\n\"My grand-aunt was not very nervous, and soon the dream faded from her mind. Months rolled by, and one morning at breakfast it was noticed that my grand-aunt had not appeared, but as she was a very religious woman it was thought that she had gone out to church. However, as she did not appear my father sent someone to her room to see if she were there, and as no answer was given to repeated knocking the door was opened, and my grand-aunt was found kneeling at her bedside, dead. The day of her death was March 14, 1873, corresponding exactly with the date seen in her dream a twelvemonth before. My grand-aunt was buried in Glasnevin, and on her tombstone (a white marble slab) was placed the inscription which she had read in her dream.\" Our correspondent sent us a photograph of the stone and its inscription.\n"
    }
  ],
  "placename": "Glasnevin Cemetary"
}