{
  "placeType": null,
  "references": [
    {
      "text": "The following tale illustrates a point we have already alluded to, namely, that the apparition is sometimes seen by a disinterested person, and not by those whom one would naturally expect should see it. A lady writes as follows: \"At Island Magee is the Knowehead Lonan, a long, hilly, narrow road, bordered on either side by high thorn-hedges and fields. Twenty years ago, when I was a young girl, I used to go to the post-office at the Knowehead on Sunday mornings down the Lonan, taking the dogs for the run. One Sunday as I had got to the top of the hill on my return journey, I looked back, and saw a man walking rapidly after me, but still a good way off. I hastened my steps, for the day was muddy, and I did not want him to see me in a bedraggled state. But he seemed to come on so fast as to be soon close behind me, and I wondered he did not pass me, so on we went, I never turning to look back. About a quarter of a mile farther on I met A. B. on 'Dick's Brae,' on her way to church or Sunday school, and stopped to speak to her. I wanted to ask who the man was, but he seemed to be so close that I did not like to do so, and expected he had passed. When I moved on, I was surprised to find he was still following me, while my dogs were lagging behind with downcast heads and drooping tails.\n\"I then passed a cottage where C. D. was out feeding her fowls. I spoke to her, and then feeling that there was no longer anyone behind, looked back, and saw the man standing with her. I would not have paid any attention to the matter had not A. B. been down at our house that afternoon, and I casually asked her:\n\"'Who was the man who was just behind me when I met you on Dick's Brae?'\n\"'What man?' said she; and noting my look of utter astonishment, added, 'I give you my word I never met a soul but yourself from the time I left home till I went down to Knowehead Lonan.'\n\"Next day C. D. came to work for us, and I asked her who was the man who was standing beside her after I passed her on Sunday.\n\"'Naebody!' she replied, 'I saw naebody but yoursel'.'\n\"It all seemed very strange, and so they thought too. About three weeks later news. came that C. D.'s only brother, a sailor, was washed overboard that Sunday morning.\""
    },
    {
      "text": "A house in the North of Ireland, near that locality which is eternally famous as having furnished the material for the last trial for witchcraft in the country, is said to be haunted, the reason being that it is built on the site of a disused and very ancient graveyard. It is said that when some repairs were being carried out nine human skulls were unearthed. It would be interesting to ascertain how many houses in Ireland are traditionally said to be built on such unpleasant sites, and if they all bear the reputation of being haunted. "
    }
  ],
  "placename": "Island Magee"
}