{
  "placeType": null,
  "references": [
    {
      "text": "The following story, which has been sent as a personal experience by Mr. William Mackey of Strabane, is similar in many ways to an extraordinary case of retro-cognitive vision which occurred some years ago to two English ladies who were paying a visit to Versailles; and who published their experiences in a book entitled, An Adventure (London, 1911). Mr. Mackey writes: \"It was during the severe winter of the Crimean War, when indulging in my favourite sport of wild-fowl shooting, that I witnessed the following strange scene. It was a bitterly cold night towards the end of November or beginning of December; the silvery moon had sunk in the west shortly before midnight; the sport had been all that could be desired, when I began to realise that the blood was frozen in my veins, and I was on the point of starting for home, when my attention was drawn to the barking of a dog close by, which was followed in a few seconds by the loud report of a musket, the echo of which had scarcely died away in the silent night, when several musket-shots went off in quick succession; this seemed to be the signal for a regular fusillade of musketry, and it was quite evident from the nature of the firing that there was attack and defence.\n\"For the life of me I could not understand what it all meant; not being superstitious I did not for a moment imagine it was supernatural, notwithstanding that my courageous dog was crouching in abject terror between my legs; beads of perspiration began to trickle down from my forehead, when suddenly there arose a flame as if a house were on fire, but I knew from the position of the blaze (which was only a few hundred yards from where I stood), that there was no house there, or any combustible that would burn, and what perplexed me most was to see pieces of burning thatch and timber sparks fall hissing into the water at my feet. When the fire seemed at its height the firing appeared to weaken, and when the clear sound of a bugle floated out on the midnight air, it suddenly ceased, and I could hear distinctly the sound of cavalry coming at a canter, their accoutrements jingling quite plainly on the frosty air; in a very short time they arrived at the scene of the fight. I thought it an eternity until they took their departure, which they did at the walk.\n\"It is needless to say that, although the scene of this tumult was on my nearest way home, I did not venture that way, as, although there are many people who would say that I never knew what fear was, I must confess on this occasion I was thoroughly frightened.\n\"At breakfast I got a good sound rating from my father for staying out so late.  My excuse was that I fell asleep and had a horrible dream, which I related. When I finished I was told I had been dreaming with my eyes open!--that I was not the first person who had witnessed this strange sight. He then told me the following narrative: 'It was towards the end of the seventeenth century that a widow named Sally Mackey and her three sons lived on the outskirts of the little settlement of the Mackeys. A warrant was issued by the Government against the three sons for high treason, the warrant being delivered for execution to the officer in command of the infantry regiment stationed at Lifford. A company was told off for the purpose of effecting the arrest, and the troops set out from Lifford at 11 P.M.\n\"'The cottage home of the Mackeys was approached by a bridle-path, leading from the main road to Derry, which only permitted the military to approach in single file; they arrived there at midnight, and the first intimation the inmates had of danger was the barking, and then the shooting, of the collie dog. Possessing as they did several stand of arms, they opened fire on the soldiers as they came in view and killed and wounded several; it was the mother, Sally Mackey, who did the shooting, the sons loading the muskets. Whether the cottage went on fire by accident or design was never known; it was only when the firing from the cottage ceased and the door was forced open that the officer in command rushed in and brought out the prostrate form of the lady, who was severely wounded and burned. All the sons perished, but the soldiers suffered severely, a good many being killed and wounded.\n\"'The firing was heard by the sentries at Lifford, and a troop of cavalry was despatched to the scene of conflict, but only arrived in time to see the heroine dragged from the burning cottage. She had not, however, been fatally wounded, and lived for many years afterwards with a kinsmen. My father remembered conversing with old men, when he was a boy, who remembered her well. She seemed to take a delight in narrating incidents of the fight to those who came to visit her, and would always finish up by making them feel the pellets between the skin and her ribs.'\""
    }
  ],
  "placename": "Lifford"
}