{"placeType":null,"references":[{"text":"door in fear and trembling: outside stood a huge dark coach with four black horses. The \"fearful guest\" entered and beckoned to Lord Tirawley, who followed him to a room off the hall. The friends, sobered by fear, saw through the door the stranger drawing a ship on the wall; the piece of wall then detached itself and the ship grew solid, the stranger climbed into it, and Lord Tirawley followed without a struggle. The vessel then sailed away into the night, and neither it nor its occupants were ever seen again.The above tale is a good example of how a legend will rise superior to the ordinary humdrum facts of life, for it strikes us at once that the gloomy spectre went to unnecessary trouble in constructing a ship, even though the task proved so simple to his gifted hands. But the coach was at the door, and surely it would have been less troublesome to have used it.A strange legend is told of a house in the Boyne valley. It is said that the occupant of the guest chamber was always wakened on the first night of his visit, then he would see a pale light and the shadow of a skeleton[p. 234][paragraph continues] \"climbing the wall like a huge spider.\" It used to crawl out on to the ceiling, and when it reached the middle would materialise into apparent bones, holding on by its hands and feet; it would break in pieces, and first the skull and then the other bones would fall on the floor. One person had the courage to get up and try to seize a bone, but his hand passed through to the carpet though the heap was visible for a few seconds.The following story can hardly be called legendary, though it may certainly be termed ancestral. The writer's name is not given, but he is described as a rector and Rural Dean in the late Established Church of Ireland, and a Justice of the Peace for two counties. It has this added interest that it was told to Queen Victoria by the Marchioness of Ely.\"Loftus Hall, in County Wexford, was built on the site of a stronghold erected by Raymond, one of Strongbow's followers. His descendants forfeited it in 1641, and the property subsequently fell into the hands of the Loftus family, one of whom built the house and other buildings. About the[p. 235]"}],"placename":"Boyne valley"}