{"placeType":null,"references":[{"text":"mentioned what had occurred, and was then informed by an old resident in the neighbourhood that that woman had constantly been seen up to twenty years before, but not since that date. By the country-people the road was believed to be haunted, but the percipient did not know this at the time.The following is sent us by Mr. T. J. Westropp, and has points of its own which are interesting; he states: \"On the road from Bray to Windgates, at the Deerpark of Kilruddy, is a spot which, whatever be the explanation, is distinguished by weird sounds and (some say) sights. I on one occasion was walking with a friend to catch the train at Bray about eleven o'clock one evening some twenty-five years ago, when we both heard heavy steps and rustling of bracken in the Deerpark; apparently some one got over the gate, crossed the road with heavy steps and fell from the wall next Bray Head, rustling and slightly groaning. The night was lightsome, though without actual moonlight, and we could see nothing over the wall where we had heard the noise.\"For several years after I dismissed the matter as a delusion; but when I told the[p. 132]story to some cousins, they said that another relative (now a Fellow of Trinity College, Dublin) had heard it too, and that there was a local belief that it was the ghost of a poacher mortally wounded by gamekeepers, who escaped across the road and died beyond it.\" Mr. Westropp afterwards got the relative mentioned above to tell his experience, and it corresponded with his own, except that the ghost was visible. \"The clergyman who was rector of Greystones at that time used to say that he had heard exactly similar noises though he had seen nothing.\"The following story of an occurrence near Dublin is sent us by a lady who is a very firm believer in ghosts. On a fine night some years ago two sisters were returning home from the theatre. They were walking along a very lonely part of the Kimmage Road about two miles beyond the tram terminus, and were chatting gaily as they went, when suddenly they heard the \"clink, clink\" of a chain coming towards them. At first they thought it was a goat or a donkey which had got loose, and was dragging its chain along the ground. But they could see nothing, and could hear no noise[p. 133]"}],"placename":"Bray"}