{"placeType":null,"references":[{"text":"The second story relates how a lady witnessed a vision (shall we call it) of a suicide a week before the terrible deed was committed. This incident surely makes it clear that such cannot be looked upon as special interventions of Providence, for if the lady had recognised the man, she might have prevented his rash act. Mrs. MacAlpine says: \"In June 1889, I drove to Castleblaney, in Co. Monaghan, to meet my sister: I expected her at three o'clock, but as she did not come by that train, I put up the horse and went for a walk in the demesne. At length becoming tired, I sat down on a rock by the edge of a lake. My attention was quite taken up with the beauty of the scene before me, as it was a glorious summer's day. Presently I felt a cold chill creep through me, and a curious stiffness came over my limbs, as if I could not move, though wishing to do so. I felt frightened, yet chained to the spot, and as if impelled to stare at the water straight before me. Gradually a black cloud seemed to rise, and in the midst of it I saw a tall man, in a tweed suit, jump into the water, and sink. In a moment the darkness was[p. 173]gone, and I again became sensible of the heat and sunshine, but I was awed, and felt eerie. This happened about June 25, and on July 3 a Mr. --, a bank clerk, committed suicide by drowning himself in the lake.\" [*1]The following incident occurred in the United States, but, as it is closely connected with this country, it will not seem out of place to insert it here. It is sent by Mr. Richard Hogan as the personal experience of his sister, Mrs. Mary Murnane, and is given in her own words.\"On the 4th of August 1886, at 10.30 o'clock in the morning, I left my own house, 21 Montrose St., Philadelphia, to do some shopping. I had not proceeded more than fifty yards when on turning the corner of the street I observed my aunt approaching me within five or six yards. I was greatly astonished, for the last letter I had from home (Limerick) stated that she was dying of consumption, but the thought occurred to me that she might have recovered somewhat, and come out to Philadelphia. This opinion was quickly changed as we[p. 174]"}],"placename":"CASTLEBLANEY"}