{"placeType":null,"references":[{"text":"[paragraph continues] G., what she had seen, and the latter told her that something always happened when that appeared. Miss K. B. adds that nothing did happen. Later on she was told that a colonel had cut his throat in that very room.Another military station, Charles Fort, near Kinsale, has long had the reputation of being haunted. An account of this was sent to the Wide World Magazine (Jan. 1908), by Major H. L. Ruck Keene, D.S.O.; he states that he took it from a manuscript written by a Captain Marvell Hull about the year 1880. Further information on the subject of the haunting is to be found in Dr. Craig's Real Pictures of Clerical Life in Ireland. [*1]*Charles Fort was erected in 1667 by the Duke of Ormonde. It is said to be haunted by a ghost known as the \"White Lady,\" and the traditional account of the reason for this haunting is briefly as follows: Shortly after the erection of the fort, a Colonel Warrender, a severe disciplinarian, was appointed its governor. He had a daughter, who bore the quaint Christian name of[p. 66][paragraph continues] \"Wilful\"; she became engaged to a Sir Trevor Ashurst, and subsequently married him. On the evening of their wedding-day the bride and bridegroom were walking on the battlements, when she espied some flowers growing on the rocks beneath. She expressed a wish for them, and a sentry posted close by volunteered to climb down for them, provided Sir Trevor took his place during his absence. He assented, and took the soldier's coat and musket while he went in search of a rope. Having obtained one, he commenced his descent; but the task proving longer than he expected, Sir Trevor fell asleep. Meantime the governor visited the sentries, as was his custom, and in the course of his rounds came to where Sir Trevor was asleep. He challenged him, and on receiving no answer perceived that he was asleep, whereupon he drew a pistol and shot him through the heart. The body was brought in, and it was only then the governor realised what had happened. The bride, who appears to have gone indoors before the tragedy occurred, then learned the fate that befell her husband, and in her distraction, rushed from the house and flung herself[p. 67]"}],"placename":"Charles Fort"}