{"placeType":null,"references":[{"text":"Two stories are told about haunted houses at Drogheda, the one by A. G. Bradley in Notes on some Irish Superstitions (Drogheda, 1894), the other by F. G. Lee in Sights and Shadows (p. 42) . As both appear to be placed at the same date, i.e. 1890, it is quite possible that they refer to one and the same haunting, and we have so treated them accordingly. The reader, if he wishes, can test the matter for himself.This house, which was reputed to be haunted, was let to a tailor and his wife by the owner at an annual rent of L23. They took possession in due course, but after a very few days they became aware of the presence of a most unpleasant supernatural lodger. One night, as the tailor and his wife were preparing to retire, they were terrified at seeing the foot of some invisible person kick the candlestick off the table, and so quench the candle. Although it was a very dark night, and the shutters were closed, the man and his wife could see everything in the room just as well as if it were the middle of the day. All at once a woman entered the room, dressed in white, carrying something in her hand,[p. 49]which she threw at the tailor's wife, striking her with some violence, and then vanished. While this was taking place on the first floor, a most frightful noise was going on overhead in the room where the children and their nurse were sleeping. The father immediately rushed upstairs, and found to his horror the floor all torn up, the furniture broken, and, worst of all, the children lying senseless and naked on the bed, and having the appearance of having been severely beaten. As he was leaving the room with the children in his arms he suddenly remembered that he had not seen the nurse, so he turned back with the intention of bringing her downstairs, but could find her nowhere. The girl, half-dead with fright, and very much bruised, had fled to her mother's house, where she died in a few days in agony.Because of these occurrences they were legally advised to refuse to pay any rent. The landlady, however, declining to release them from their bargain, at once claimed a quarter's rent; and when this remained for some time unpaid, sued them for it before Judge Kisby. A Drogheda solicitor appeared[p. 50]"}],"placename":"Drogheda"}