{"placeType":null,"references":[{"text":"out, gave one yell, and fell in a heap. When the badly-scared Burke picked himself up there was no sign or sound of any coach. A little later the invalid arrived, so exhausted that he died suddenly in the early morning.On the night of December 11, 1876, a servant of the MacNamaras was going his rounds at Ennistymon, a beautiful spot in a wooded glen, with a broad stream falling in a series of cascades. In the dark he heard the rumbling of wheels on the back avenue, and, knowing from the hour and place that no mortal vehicle could be coming, concluded that it was the death coach, and ran on, opening the gates before it. He had just time to open the third gate, and throw himself on his face beside it, when he heard a coach go clanking past. On the following day Admiral Sir Burton Macnamara died in London.Mr. Westropp informs us that at sight or sound of this coach all gates should be thrown open, and then it will not stop at the house to call for a member of the family, but will only foretell the death of some relative at a distance. We hope our readers[p. 189]will carefully bear in mind this simple method of averting fate.We may conclude this chapter with some account of strange and varied death-warnings, which are attached to certain families and foretell the coming of the King of Terrors.In a Co. Wicklow family a death is preceded by the appearance of a spectre; the doors of the sitting-room open and a lady dressed in white satin walks across the room and hall. Before any member of a certain Queen's Co. family died a looking-glass was broken; while in a branch of that family the portent was the opening and shutting of the avenue gate. In another Queen's Co. family approaching death was heralded by the cry of the cuckoo, no matter at what season of the year it might occur. A Mrs. F-- and her son lived near Clonaslee. One day, in mid-winter, their servant heard a cuckoo; they went out for a drive, the trap jolted over a stone, throwing Mrs. F-- out, and breaking her neck. The ringing of all the house-bells is another portent which seems to be attached to several families. In another the aeolian harp is heard at or before death; an account[p. 190]"}],"placename":"Ennistymon"}