{"placeType":null,"references":[{"text":"he imagined that the house must be on fire, when he felt what seemed to be a hand laid on him, and heard his friend's voice say distinctly, \"There is a God, just but terrible in His judgments,\" and all again was dark. Mr. Miller at once wrote down this remarkable experience. Two days later he received a letter announcing Mr. Scott's death on the night, and at the hour, that he had seen the light in his room.The above leads us on to the famous \"Beresford Ghost,\" which is generally regarded as holding the same position relative to Irish ghosts that Dame Alice Kyteler used to hold with respect to Irish witches and wizards. The story is so well known, and has been published so often, that only a brief allusion is necessary, with the added information that the best version is to be found in Andrew Lang's Dreams and Ghosts, chapter viii. (Silver Library Edition). Lord Tyrone appeared after death one night to Lady Beresford at Gill Hall, in accordance with a promise (as in the last story) made in early life. He assured her that the religion as revealed by Jesus Christ was the only true one (both he and Lady Beresford[p. 160]had been brought up Deists), told her that she was enceinte and would bear a son, and also foretold her second marriage, and the time of her death. In proof whereof he drew the bed-hangings through an iron hook, wrote his name in her pocket-book, and finally placed a hand cold as marble on her wrist, at which the sinews shrunk up.. To the day of her death Lady Beresford wore a black ribbon round her wrist; this was taken off before her burial, and it was. found the nerves were withered, and the sinews shrunken, as she had previously described to her children.  GROUP IIWe now come to some stories of apparitions seen some time after the hour of death. Canon Ross-Lewin, of Limerick, furnishes the following incident in his own family. \"My uncle, John Dillon Ross-Lewin, lieutenant in the 30th Regiment, was mortally wounded at Inkerman on November 5, 1854, and died on the morning of the 6th. He appeared that night to his mother, who was then on a visit in Co. Limerick, intimating[p. 161]"}],"placename":"Gill Hall"}