{"placeType":null,"references":[{"text":"heard a child crying with a peculiar whining cry, and distinctly saw a small childlike figure running round and round the grass ring inside the evergreen hedge, and casting a shadow in the moonlight. Going into the house she casually mentioned this as a peculiar circumstance to Mrs. G--, upon which, to her great surprise, that lady nearly fainted, and got into a terrible state of nervousness. Recovering a little, she told her that this crying and figure were always heard and seen whenever any member met with an accident, or before a death. A messenger was immediately sent to meet Mr. G--, who was found lying senseless on the road, as the horses had taken fright and bolted, flinging him out, and breaking the carriage-pole.But of all the death-warnings in connection with Irish families surely the strangest is the Gormanstown foxes. The crest of that noble family is a running fox, while the same animal also forms one of the supporters of the coat-of-arms. The story is, that when the head of the house is dying the foxes--not spectral foxes, but creatures of flesh and blood--leave the coverts and congregate at Gormanstown Castle.[p. 196]Let us see what proof there is of this. When Jenico, the 12th Viscount, was dying in 1860, foxes were seen about the house and moving towards the house for some days previously. Just before his death three foxes were playing about and making a noise close to the house, and just in front of the \"cloisters,\" which are yew-trees planted and trained in that shape. The Hon. Mrs. Farrell states as regards the same that the foxes came in pairs into the demesne, and sat under the Viscount's bedroom window, and barked and howled all night. Next morning they were to be found crouching about in the grass in front and around the house. They walked through the poultry and never touched them. After the funeral they disappeared.At the death of Edward, the 13th Viscount, in 1876, the foxes were also there. He had been rather better one day, but the foxes appeared, barking under the window, and he died that night contrary to expectation.On October 28, 1907, Jenico, the 14th Viscount, died in Dublin. About 8 o'clock that night the coachman and gardener saw two foxes near the chapel (close to the[p. 197]"}],"placename":"Gormanstown Castle"}