{"placeType":null,"references":[{"text":"  GROUP IIIWe now come to the third group of this chapter, in which we shall relate two firsthand experiences of tragedies being actually witnessed some time before they happened, as well as a reliable second-hand story of an apparition being seen two days before the death occurred. The first of these is sent by a lady, the percipient, who desires that her name be suppressed; with it was enclosed a letter from a gentleman who stated that he could testify to the truth of the following facts:\"The morning of May 18, 1902, was one of the worst that ever dawned in Killarney. All through the day a fierce nor'-wester raged, and huge white-crested waves, known locally as 'The O'Donoghue's white horses,' beat on the shores of Lough Leane. Then followed hail-showers such as I have never seen before or since. Hailstones quite as large as small marbles fell with such rapidity, and seemed so hard that the glass in the windows of the room in which I stood appeared to be about to break into fragments every moment. I remained[p. 170]at the window, gazing out on the turbulent waters of the lake. Sometimes a regular fog appeared, caused by the terrible downpour of rain and the fury of the gale.\"During an occasional lull I could see the islands plainly looming in the distance. In one of these clear intervals, the time being about 12.30 P.M., five friends of mine were reading in the room in which I stood. 'Quick! quick!' I cried. 'Is that a boat turned over?' My friends all ran to the windows, but could see nothing. I persisted, however, and said, 'It is on its side, with the keel turned towards us, and it is empty.' Still none of my friends could see anything. I then ran out, and got one of the men-servants to go down to a gate, about one hundred yards nearer the lake than where I stood. He had a powerful telescope, and remained with great difficulty in the teeth of the storm with his glass for several minutes, but could see nothing. When he returned another man took his place, but he also failed to see anything.\"I seemed so distressed that those around me kept going backwards and forwards to the windows, and then asked me what was[p. 171]"}],"placename":"Killarney"}