{"placeType":null,"references":[{"text":"violence and apparent anger. If left open there is no trouble or noise, but light footsteps are heard, and there is a vague feeling of people passing to and fro. The persons inhabiting the house are matter-of-fact, unimaginative people, who speak of this as if it were an everyday affair. \"So long as we leave the doors unclosed they don't harm us: why should we be afraid of them?\" Mrs. -- said. Truly a most philosophical attitude to adopt!A haunted house in Kingstown, Co. Dublin, was investigated by Professor W. Barrett and Professor Henry Sidgwick. The story is singularly well attested (as one might expect from its being inserted in the pages of the Proceedings S.P.R. [*1]), as the apparition was seen on three distinct occasions, and by three separate persons who were all personally known to the above gentlemen. The house in which the following occurrences took place is described as being a very old one, with unusually thick walls. The lady saw her strange visitant in her bedroom. She says: \"Disliking cross-lights, I had got into the habit[p. 29]of having the blind of the back window drawn and the shutters closed at night, and of leaving the blind raised and the shutters opened towards the front, liking to see the trees and sky when I awakened. Opening my eyes now one morning, I saw right before me (this occurred in July 1873) the figure of a woman, stooping down and apparently looking at me. Her head and shoulders were wrapped in a common woollen shawl; her arms were folded, and they were also wrapped, as if for warmth, in the shawl. I looked at her in my horror, and dared not cry out lest I might move the awful thing to speech or action. Behind her head I saw the window and the growing dawn, the looking-glass upon the toilet-table, and the furniture in that part of the room. After what may have been only seconds--of the duration of this vision I cannot judge--she raised herself and went backwards towards the window, stood at the toilet-table, and gradually vanished. I mean she grew by degrees transparent, and that through the shawl and the grey dress she wore I saw the white muslin of the table-cover again, and at last saw that only in the[p. 30]"}],"placename":"Kingstown"}