{"placeType":null,"references":[{"text":"curious about the glen. He replied at once: \"Oh! you mean the little sailor man. Sure, he won't do you any harm.\" This was the first she had heard of anything of the sort, but it was then found that none of the country-people would go through the glen after dusk.Some time afterwards two sons of the clergyman of the parish in which -- Court stands were out one evening fishing in the drain, when one of them suddenly said, \"What's that sailor doing there?\" The other saw nothing, and presently the figure vanished. At the time of the appearance neither had heard of Miss S--'s experience, and no one has been able to explain it, as there is apparently no tradition of any \"little sailor man\" having been there in the flesh.Mr. Joseph M'Crossan, a journalist on the staff of the Strabane Chronicle, has sent us a cutting from that paper describing a ghost which appeared to men working in an engine-house at Strabane railway station on two successive nights in October 1913. The article depicts very graphically the antics of the ghost and the fear of the men who saw it. Mr. M'Crossan interviewed[p. 137]one of these men (Pinkerton by name), and the story as told in his words is as follows: \"Michael Madden, Fred Oliphant, and I were engaged inside a shed cleaning engines, when, at half-past twelve (midnight),a knocking came to all the doors, and continued without interruption, accompanied by unearthly yells. The three of us went to one of the doors, and saw--I could swear to it without doubt--the form of a man of heavy build. I thought I was about to faint. My hair stood high on my head. We all squealed for help, when the watchman and signalman came fast to our aid. Armed with a crowbar, the signalman made a dash at the 'spirit,' but was unable to strike down the ghost, which hovered about our shed till half-past two. It was moonlight, and we saw it plainly. There was no imagination on our part. We three cleaners climbed up the engine, and hid on the roof of the engine, lying there till morning at our wit's end. The next night it came at half-past one. Oliphant approached the spirit within two yards, but he then collapsed, the ghost uttering terrible yells. I commenced work, but the spirit 'gazed' into[p. 138]"}],"placename":"STRABANE"}